<template>
  <div class="permissions-container">
    <el-row :gutter="20">
      <el-col :xs="24" :sm="24" :md="24" :lg="24" :xl="24">
        <el-divider content-position="left">
          <h1>基于表征的意见领袖跟踪</h1>
        </el-divider>
        <el-card shadow="hover">
          <div class="lodash-content">
            <h2 class="mt-25 mb-25">功能描述</h2>
            <span class="represent" style="font-size: 16px; line-height: 30px">
              实现基于用户指纹的意见领袖行为分析与跟踪技术。通过分析用户的属性特征以及行为特征，学习用户节点稠密的低维表示，
              并建立跨网络的用户身份映射模型。基于学习到的映射模型，得到不同社交平台上同属于一个意见领袖的用户节点的对应关系，从而实现意见领袖用户跟踪。
            </span>
            <br />
            <!-- <span class="represent" style="font-size: 16px; line-height: 30px">
              下面的展示结果在“HK事件”微博数据集上进行。基于微博数据集构建两个子网络（source
              network以及target network），
              学习两个子网络的用户节点之间的对应关系，实现跨社交平台的意见领袖跟踪。
            </span> -->
          </div>
          <div class="lodash-content">
            <h2 class="mt-25 mb-25">数据集选择:</h2>
            <el-select
              v-model="Value1"
              style="margin-right: 15px; font-size: 25px"
              placeholder="香港事件数据集-微博"
            >
              <el-option
                v-for="item in options1"
                :key="item.value"
                :label="item.label"
                :value="item.label"
                @click.native="chickvalue"
              ></el-option>
            </el-select>
          </div>
          <div v-if="Value1 == '香港事件数据集-微博'" class="lodash-content">
            <h2 class="mt-25 mb-25">数据集描述</h2>
            <span class="represent" style="font-size: 16px; line-height: 30px">
              我们选取了2019年9月24日到10月7日共14天的HK事件的微博数据集，这些数据包含了用户的个人信息和用户间的转发、评论等行为数据。微博的原始数据集是
              个稀疏网络，我们剔除网络中的不活跃用户，保留参与程度高的用户。处理好的网络数据集中共包含4983个节点，24935条连边，节点表示微博用户，
              连边表示转发、评论等关系。
            </span>
            <!-- <h2 class="mt-25 mb-25">事件描述</h2>
            <span class="represent" style="font-size: 16px; line-height: 30px">
              香港“占中”事件在社交网络上引起了广泛的讨论，境外媒体和记者在社交网路上发布一些内容抹黑香港警察，用一些夸张虚假的内容引导群众舆论，因此对舆论进行正确的引导是必须的。
            </span> -->
          </div>
          <div v-if="Value1 == '豆瓣'" class="lodash-content">
            <h2 class="mt-25 mb-25">数据集描述</h2>
            <span class="represent" style="font-size: 16px; line-height: 30px">
              豆瓣数据集是从豆瓣网站上爬取的真实数据集。豆瓣数据集分为online和offline两个网络。Online网络包含3906个用户节点，16328条连边。
              Offline网络包含1118个用户节点，3022条连边。其中用户共同参与10~20个相同线下活动的情况视作用户间存在连边。
              Online网络中包含了所有offline网络中的用户，因此可以有1118个锚用户对。
            </span>
            <!-- <h2 class="mt-25 mb-25">事件描述</h2>
            <span class="represent" style="font-size: 16px; line-height: 30px">
              香港“占中”事件在社交网络上引起了广泛的讨论，境外媒体和记者在社交网路上发布一些内容抹黑香港警察，用一些夸张虚假的内容引导群众舆论，因此对舆论进行正确的引导是必须的。
            </span> -->
          </div>
          <div v-if="Value1 == 'Foursquare-Twitter'" class="lodash-content">
            <h2 class="mt-25 mb-25">数据集描述</h2>
            <span class="represent" style="font-size: 16px; line-height: 30px">
              Foursquare-Twitter数据集是从Foursquare网站和Twitter网站分别爬取的真实数据集。通过Foursquare网站上用户提供的Twitter网站链接从而得到锚用户信息。
            </span>
            <!-- <h2 class="mt-25 mb-25">事件描述</h2>
            <span class="represent" style="font-size: 16px; line-height: 30px">
              香港“占中”事件在社交网络上引起了广泛的讨论，境外媒体和记者在社交网路上发布一些内容抹黑香港警察，用一些夸张虚假的内容引导群众舆论，因此对舆论进行正确的引导是必须的。
            </span> -->
          </div>
          <div v-if="Value1 == '香港事件数据集-微博'" class="lodash-content">
            <h2 class="mt-25 mb-25">子网络参数：</h2>
            <el-row>
              <span
                class="represent"
                style="font-size: 16px; line-height: 30px"
              >
                以上述微博数据集为基础，对节点之间的连边进行抽样，构建两个微博子网络，下面可以选择两个子网络分别的稀疏度，以及两个子网络之间的重叠度。
              </span>
            </el-row>
            <br />
            <br />
            <br />
            <span class="mt-25 mb-25" style="font-size: 16px">稀疏度：</span>
            <el-select
              v-model="value1"
              style="margin-left: 5px"
              placeholder="0.7"
            >
              <el-option
                v-for="item in options2"
                :key="item.value"
                :label="item.label"
                :value="item.label"
              ></el-option>
            </el-select>
            <span
              class="mt-25 mb-25"
              style="margin-left: 50px; font-size: 16px"
            >
              重叠度：
            </span>
            <el-select
              v-model="value2"
              collapse-tags
              style="margin-left: 5px"
              placeholder="0.7"
            >
              <el-option
                v-for="item in options2"
                :key="item.value"
                :label="item.label"
                :value="item.label"
              ></el-option>
            </el-select>
            <el-button
              type="primary"
              style="margin-left: 70px"
              icon="el-icon-video-play"
              @click="generatenetwork"
            >
              <span style="font-size: 15px">构建子网络</span>
            </el-button>
          </div>
          <div v-if="Value1 == '香港事件数据集-微博'" class="lodash-content">
            <h2 class="mt-25 mb-25">网络构建：</h2>
            <span
              v-show="isShow"
              style="font-size: 16px; line-height: 30px"
              @click="generatenetwork"
            >
              已构建按照稀疏度为{{ value3 }}，重叠度为{{
                value4
              }}的随机抽样的source network和target
              network。由于两个子网络是以同一个微博数据集为基础构建的，所以可以知道两个网络的节点之间的对应关系（即同属于一个用户的节点对应关系），从而进行意见领袖节点的跟踪。
            </span>
          </div>
        </el-card>
      </el-col>
    </el-row>
    <!-- <el-row :gutter="20">
      <el-col :xs="24" :sm="24" :md="24" :lg="24" :xl="24">
        <el-card shadow="hover"> -->

    <!-- </el-card>
      </el-col>
    </el-row> -->
    <el-row :gutter="20">
      <el-col :xs="24" :sm="24" :md="24" :lg="24" :xl="24">
        <el-card shadow="hover">
          <div slot="header">
            <span style="font-size: 18px">意见领袖跟踪：</span>
            <el-button
              type="primary"
              style="margin-left: 40px"
              icon="el-icon-video-play"
              @click="generatenetwork1"
            >
              <span style="font-size: 17px">显示结果</span>
            </el-button>
          </div>
          <div class="lodash-content">
            <el-row>
              <h2 class="mt-25 mb-25">定性结果：</h2>
            </el-row>
            <el-row>
              <el-col :xs="24" :sm="24" :md="24" :lg="24" :xl="24">
                <!-- <div class="Echarts">
                  <div id="main" style="width: 800px; height: 650px"></div>
                </div> -->
                <div v-if="Value1 == '香港事件数据集-微博'">
                  <el-row>
                    <span
                      class="mt-25 mb-25"
                      style="font-size: 16px; line-height: 34px"
                    >
                      下面结果为随机选择的50对source network与target
                      network节点的相似度矩阵，相似度越高则表示系统认为其对应于同一意见领袖的可能性越大。
                      <br />
                      矩阵中的方块显示了对应的横坐标节点与纵坐标节点的相似度，相似度越大，则方块的颜色越深。
                      <br />
                      相似度矩阵的对角线颜色越深，则表示意见领袖跟踪任务效果越好。
                      <!-- <br />
                根据意见领袖发现任务中找出的10个意见领袖节点进行跟踪，均找到了其对应的节点。下面的列表显示在子网络source
                network与target network中两个节点的相似度。 表格中用户名列表： -->
                    </span>
                  </el-row>
                </div>
                <div
                  v-show="isShow1"
                  v-if="Value1 == '香港事件数据集-微博'"
                  class="Echarts"
                >
                  <!-- <img :src="item.head_portrait" :onerror="errorimg" alt /> -->
                  <img
                    :src="`/images/${
                      images[Value2 + ',' + value6 + ',' + value7]
                    }.PNG`"
                    alt=""
                    style="width: 365px; height: 335px"
                  />
                </div>
                <div v-if="Value1 == '豆瓣'">
                  <el-row>
                    <span
                      class="mt-25 mb-25"
                      style="font-size: 16px; line-height: 34px"
                    >
                      下面结果为随机选择的50对online network与offline
                      network节点的相似度矩阵，相似度越高则表示系统认为其对应于同一意见领袖的可能性越大。
                      <br />
                      矩阵中的方块显示了对应的横坐标节点与纵坐标节点的相似度，相似度越大，则方块的颜色越深。
                      <br />
                      相似度矩阵的对角线颜色越深，则表示意见领袖跟踪任务效果越好。
                    </span>
                  </el-row>
                </div>
                <div v-show="isShow2" v-if="Value1 == '豆瓣'" class="Echarts">
                  <img
                    :src="`/images/11.PNG`"
                    alt=""
                    style="width: 365px; height: 335px"
                  />
                </div>
                <div v-if="Value1 == 'Foursquare-Twitter'">
                  <el-row>
                    <span
                      class="mt-25 mb-25"
                      style="font-size: 16px; line-height: 34px"
                    >
                      下面结果为随机选择的50对Foursquare network与Twitter
                      network节点的相似度矩阵，相似度越高则表示系统认为其对应于同一意见领袖的可能性越大。
                      <br />
                      矩阵中的方块显示了对应的横坐标节点与纵坐标节点的相似度，相似度越大，则方块的颜色越深。
                      <br />
                      相似度矩阵的对角线颜色越深，则表示意见领袖跟踪任务效果越好。
                    </span>
                  </el-row>
                </div>
                <div
                  v-show="isShow3"
                  v-if="Value1 == 'Foursquare-Twitter'"
                  class="Echarts"
                >
                  <img
                    :src="`/images/12.PNG`"
                    alt=""
                    style="width: 365px; height: 335px"
                  />
                </div>
              </el-col>
              <!-- <el-col :xs="24" :sm="24" :md="24" :lg="24" :xl="24">
                <div
                  v-if="user_data_content[value6 + ',' + value7]"
                  class="border2"
                >
                  <el-table
                    :data="user_data_content[value6 + ',' + value7].list8"
                    border
                    style="width: 55%"
                  >
                    <el-table-column
                      v-for="(item, index) in user_data_content[
                        value6 + ',' + value7
                      ].list7"
                      :key="index"
                      :prop="item.tableprop"
                      :label="item.label"
                      min-width="25%"
                      align="center"
                    ></el-table-column>
                  </el-table>
                </div>
              </el-col> -->
            </el-row>
          </div>
        </el-card>
      </el-col>
    </el-row>
    <el-row :gutter="20">
      <el-col :xs="24" :sm="24" :md="24" :lg="24" :xl="24">
        <el-card shadow="hover">
          <div class="lodash-content">
            <el-row>
              <h2 class="mt-25 mb-25">定量结果：</h2>
            </el-row>
            <div v-if="Value1 == '香港事件数据集-微博'">
              <el-row>
                <span
                  class="mt-25 mb-25"
                  style="font-size: 16px; line-height: 30px"
                >
                  系统为给定的source network中意见领袖节点提供target
                  network中节点的列表，列表中排名越靠前的节点表示系统计算其与给定节点对应属于同一身份的概率越大。
                </span>
              </el-row>
            </div>
            <div v-if="Value1 == '豆瓣'">
              <el-row>
                <span
                  class="mt-25 mb-25"
                  style="font-size: 16px; line-height: 30px"
                >
                  系统为给定的online network中意见领袖节点提供offline
                  network中节点的列表，列表中排名越靠前的节点表示系统计算其与给定节点对应属于同一身份的概率越大。
                </span>
              </el-row>
            </div>
            <div v-if="Value1 == 'Foursquare-Twitter'">
              <el-row>
                <span
                  class="mt-25 mb-25"
                  style="font-size: 16px; line-height: 30px"
                >
                  系统为给定的Foursquare network中意见领袖节点提供Twitter
                  network中节点的列表，列表中排名越靠前的节点表示系统计算其与给定节点对应属于同一身份的概率越大。
                </span>
              </el-row>
            </div>

            <el-row>
              <div v-if="Value1 == '香港事件数据集-微博'" class="border1">
                <el-table
                  :data="tableData[Value1][value6 + ',' + value7]"
                  border
                  style="width: 46.5%"
                >
                  <el-table-column
                    prop="top-k"
                    label="top-k"
                    min-width="25%"
                    align="center"
                  ></el-table-column>
                  <el-table-column
                    prop="precision"
                    label="precision"
                    min-width="25%"
                    align="center"
                  ></el-table-column>
                </el-table>
                <!-- <el-table
                  :data="user_data_content[value6 + ',' + value7].list10"
                  border
                  style="width: 46.5%"
                >
                  <el-table-column
                    v-for="(item, index) in user_data_content[
                      value6 + ',' + value7
                    ].list9"
                    :key="index"
                    :prop="item.tableprop"
                    :label="item.label"
                    min-width="25%"
                    align="center"
                  ></el-table-column>
                </el-table> -->
              </div>
              <div v-if="Value1 == '香港事件数据集-微博'">
                <el-row>
                  <span
                    class="mt-25 mb-25"
                    style="font-size: 16px; line-height: 30px"
                  >
                    网络结构图上蓝色节点为在返回的top-1节点中找到对应节点的用户，红色节点为在返回的top-1节点中未找到正确对应节点的用户。可以看到，大部分节点都在另一个网络中找到了对应的用户节点。
                    <!-- 上面结果为意见领袖跟踪准确度，准确率指的是给定意见领袖节点的实际对应节点在系统提供的列表中出现在前k个节点的概率。 -->
                  </span>
                </el-row>
                <el-row>
                  <el-col :xs="12" :sm="12" :md="12" :lg="12" :xl="12">
                    <div v-show="isShow1" class="Echarts1">
                      <img
                        :src="`/images/${
                          images1[Value2 + ',' + value6 + ',' + value7]
                        }.png`"
                        alt=""
                        style="width: 378px; height: 345px"
                      />
                    </div>
                  </el-col>
                  <el-col :xs="12" :sm="12" :md="12" :lg="12" :xl="12">
                    <div v-show="isShow1" class="Echarts2">
                      <img
                        :src="`/images/${
                          images2[Value2 + ',' + value6 + ',' + value7]
                        }.png`"
                        alt=""
                        style="width: 378px; height: 345px"
                      />
                    </div>
                  </el-col>
                </el-row>
              </div>
              <div v-if="Value1 == '豆瓣'" class="border1">
                <el-table :data="tableData[Value1]" border style="width: 46.5%">
                  <el-table-column
                    prop="top-k"
                    label="top-k"
                    min-width="25%"
                    align="center"
                  ></el-table-column>
                  <el-table-column
                    prop="precision"
                    label="precision"
                    min-width="25%"
                    align="center"
                  ></el-table-column>
                </el-table>
              </div>
              <div v-if="Value1 == '豆瓣'">
                <el-row>
                  <span
                    class="mt-25 mb-25"
                    style="font-size: 16px; line-height: 30px"
                  >
                    网络结构图上蓝色节点为在返回的top-1节点中找到对应节点的用户，红色节点为在返回的top-1节点中未找到正确对应节点的用户。可以看到，大部分节点都在另一个网络中找到了对应的用户节点。
                  </span>
                </el-row>
                <el-row>
                  <el-col :xs="12" :sm="12" :md="12" :lg="12" :xl="12">
                    <div v-show="isShow2" class="Echarts1">
                      <img
                        :src="`/images/Douban online.png`"
                        alt=""
                        style="width: 378px; height: 345px"
                      />
                    </div>
                  </el-col>
                  <el-col :xs="12" :sm="12" :md="12" :lg="12" :xl="12">
                    <div v-show="isShow2" class="Echarts2">
                      <img
                        :src="`/images/Douban offline.png`"
                        alt=""
                        style="width: 378px; height: 345px"
                      />
                    </div>
                  </el-col>
                </el-row>
              </div>
              <div v-if="Value1 == 'Foursquare-Twitter'" class="border1">
                <el-table :data="tableData[Value1]" border style="width: 46.5%">
                  <el-table-column
                    prop="top-k"
                    label="top-k"
                    min-width="25%"
                    align="center"
                  ></el-table-column>
                  <el-table-column
                    prop="precision"
                    label="precision"
                    min-width="25%"
                    align="center"
                  ></el-table-column>
                </el-table>
              </div>
              <div v-if="Value1 == 'Foursquare-Twitter'">
                <el-row>
                  <span
                    class="mt-25 mb-25"
                    style="font-size: 16px; line-height: 30px"
                  >
                    网络结构图上蓝色节点为在返回的top-1节点中找到对应节点的用户，红色节点为在返回的top-1节点中未找到正确对应节点的用户。可以看到，大部分节点都在另一个网络中找到了对应的用户节点。
                  </span>
                </el-row>
                <el-row>
                  <el-col :xs="12" :sm="12" :md="12" :lg="12" :xl="12">
                    <div v-show="isShow3" class="Echarts1">
                      <img
                        :src="`/images/Foursquare.png`"
                        alt=""
                        style="width: 378px; height: 345px"
                      />
                    </div>
                  </el-col>
                  <el-col :xs="12" :sm="12" :md="12" :lg="12" :xl="12">
                    <div v-show="isShow3" class="Echarts2">
                      <img
                        :src="`/images/Twitter.png`"
                        alt=""
                        style="width: 378px; height: 345px"
                      />
                    </div>
                  </el-col>
                </el-row>
              </div>
            </el-row>
          </div>
        </el-card>
      </el-col>
    </el-row>
  </div>
</template>

<script>
import { getList } from "@/api/blacklist";
import { mapGetters } from "vuex";
import { tokenTableName } from "@/config/settings";
import JsonEditor from "@/components/JsonEditor";
import axios from "axios";
import echarts from "echarts";
import Heatmap from "heatmap.js";

export default {
  name: "Permissions",
  components: {
    JsonEditor,
  },

  data() {
    return {
      options1: [
        {
          value: "数据集一",
          label: "香港事件数据集-微博",
        },
        {
          value: "数据集二",
          label: "豆瓣",
        },
        {
          value: "数据集三",
          label: "Foursquare-Twitter",
        },
      ],
      Value1: "香港事件数据集-微博",
      Value2: "香港事件数据集-微博",
      options2: [
        {
          value: "选项1",
          label: "0.7",
        },
        {
          value: "选项2",
          label: "0.8",
        },
        {
          value: "选项3",
          label: "0.9",
        },
      ],
      // errorimg: 'this.src="' + require("../../../../public/images/l.png") + '"',
      tableData: {
        "香港事件数据集-微博": {
          "0.7,0.7": [
            {
              "top-k": "1",
              precision: "75.46%",
            },
          ],
          "0.7,0.8": [
            {
              "top-k": "1",
              precision: "81.16%",
            },
          ],
          "0.7,0.9": [
            {
              "top-k": "1",
              precision: "84.47%",
            },
          ],
          "0.8,0.7": [
            {
              "top-k": "1",
              precision: "75.73%",
            },
          ],
          "0.8,0.8": [
            {
              "top-k": "1",
              precision: "83.11%",
            },
          ],
          "0.8,0.9": [
            {
              "top-k": "1",
              precision: "85.71%",
            },
          ],
          "0.9,0.7": [
            {
              "top-k": "1",
              precision: "76.97%",
            },
          ],
          "0.9,0.8": [
            {
              "top-k": "1",
              precision: "83.91%",
            },
          ],
          "0.9,0.9": [
            {
              "top-k": "1",
              precision: "86.33%",
            },
          ],
        },
        豆瓣: [
          {
            "top-k": "1",
            precision: "79.46%",
          },
        ],
        "Foursquare-Twitter": [
          {
            "top-k": "1",
            precision: "75.46%",
          },
        ],
      },
      user_data_content: {},
      images: {
        "香港事件数据集-微博,0.7,0.7": "1",
        "香港事件数据集-微博,0.7,0.8": "2",
        "香港事件数据集-微博,0.7,0.9": "3",
        "香港事件数据集-微博,0.8,0.7": "4",
        "香港事件数据集-微博,0.8,0.8": "5",
        "香港事件数据集-微博,0.8,0.9": "6",
        "香港事件数据集-微博,0.9,0.7": "7",
        "香港事件数据集-微博,0.9,0.8": "8",
        "香港事件数据集-微博,0.9,0.9": "9",
        豆瓣: "10",
        "Foursquare-Twitter": "11",
      },
      images1: {
        "香港事件数据集-微博,0.7,0.7": "source network-s0.7c0.7",
        "香港事件数据集-微博,0.7,0.8": "source network-s0.7c0.8",
        "香港事件数据集-微博,0.7,0.9": "source network-s0.7c0.9",
        "香港事件数据集-微博,0.8,0.7": "source network-s0.8c0.7",
        "香港事件数据集-微博,0.8,0.8": "source network-s0.8c0.8",
        "香港事件数据集-微博,0.8,0.9": "source network-s0.8c0.9",
        "香港事件数据集-微博,0.9,0.7": "source network-s0.9c0.7",
        "香港事件数据集-微博,0.9,0.8": "source network-s0.9c0.8",
        "香港事件数据集-微博,0.9,0.9": "source network-s0.9c0.9",
        豆瓣: "Douban online",
        "Foursquare-Twitter": "Foursquare",
      },
      images2: {
        "香港事件数据集-微博,0.7,0.7": "target network-s0.7c0.7",
        "香港事件数据集-微博,0.7,0.8": "target network-s0.7c0.8",
        "香港事件数据集-微博,0.7,0.9": "target network-s0.7c0.9",
        "香港事件数据集-微博,0.8,0.7": "target network-s0.8c0.7",
        "香港事件数据集-微博,0.8,0.8": "target network-s0.8c0.8",
        "香港事件数据集-微博,0.8,0.9": "target network-s0.8c0.9",
        "香港事件数据集-微博,0.9,0.7": "target network-s0.9c0.7",
        "香港事件数据集-微博,0.9,0.8": "target network-s0.9c0.8",
        "香港事件数据集-微博,0.9,0.9": "target network-s0.9c0.9",
        豆瓣: "Douban offline",
        "Foursquare-Twitter": "Twitter",
      },
      isShow: false,
      isShow1: false,
      isShow2: true,
      isShow3: false,
      value1: 0.7,
      value2: 0.7,
      value3: "",
      value4: "",
      hours: [
        "user_1",
        "user_2",
        "user_3",
        "user_4",
        "user_5",
        "user_6",
        "user_7",
        "user_8",
        "user_9",
        "user_10",
        "user_11",
        "user_12",
        "user_13",
        "user_14",
        "user_15",
        "user_16",
        "user_17",
        "user_18",
        "user_19",
        "user_20",
        "user_21",
        "user_22",
        "user_23",
        "user_24",
        "user_25",
        "user_26",
        "user_27",
        "user_28",
        "user_29",
        "user_30",
        "user_31",
        "user_32",
        "user_33",
        "user_34",
        "user_35",
        "user_36",
        "user_37",
        "user_38",
        "user_39",
        "user_40",
        "user_41",
        "user_42",
        "user_43",
        "user_44",
        "user_45",
        "user_46",
        "user_47",
        "user_48",
        "user_49",
        "user_50",
      ],
      days: [
        "user_1",
        "user_2",
        "user_3",
        "user_4",
        "user_5",
        "user_6",
        "user_7",
        "user_8",
        "user_9",
        "user_10",
        "user_11",
        "user_12",
        "user_13",
        "user_14",
        "user_15",
        "user_16",
        "user_17",
        "user_18",
        "user_19",
        "user_20",
        "user_21",
        "user_22",
        "user_23",
        "user_24",
        "user_25",
        "user_26",
        "user_27",
        "user_28",
        "user_29",
        "user_30",
        "user_31",
        "user_32",
        "user_33",
        "user_34",
        "user_35",
        "user_36",
        "user_37",
        "user_38",
        "user_39",
        "user_40",
        "user_41",
        "user_42",
        "user_43",
        "user_44",
        "user_45",
        "user_46",
        "user_47",
        "user_48",
        "user_49",
        "user_50",
      ],
      data1: [
        [0, 0, 2.2586424],
        [0, 1, -0.089180566],
        [0, 2, 1.2960428],
        [0, 3, 0.07640963],
        [0, 4, -0.11103875],
        [0, 5, -0.76610029],
        [0, 6, -0.14943533],
        [0, 7, 0.097282834],
        [0, 8, 0.97626096],
        [0, 9, -0.38082841],
        [0, 10, -0.13161695],
        [0, 11, 0.3299526],
        [0, 12, 1.2506186],
        [0, 13, -0.67871726],
        [0, 14, -0.4587287],
        [0, 15, 0.45598945],
        [0, 16, -0.30344725],
        [0, 17, -0.019261966],
        [0, 18, -0.40934759],
        [0, 19, 0.36676368],
        [0, 20, 0.31573489],
        [0, 21, -0.25858063],
        [0, 22, -0.37964839],
        [0, 23, 0.65401196],
        [0, 24, -2.3174021],
        [0, 25, -2.0410788],
        [0, 26, 0.44292647],
        [0, 27, 0.27580148],
        [0, 28, 0.59183049],
        [0, 29, -0.096368238],
        [0, 30, -0.77188849],
        [0, 31, 1.274533],
        [0, 32, 0.13030984],
        [0, 33, 0.3542603],
        [0, 34, 0.70324618],
        [0, 35, 0.26605463],
        [0, 36, -0.33191055],
        [0, 37, 1.2361928],
        [0, 38, 0.40433091],
        [0, 39, 0.27246058],
        [0, 40, 0.41368613],
        [0, 41, 0.93481869],
        [0, 42, 0.33149964],
        [0, 43, -0.10169849],
        [0, 44, 0.5426743],
        [0, 45, 0.61523539],
        [0, 46, 0.27743953],
        [0, 47, 1.4812021],
        [0, 48, 0.38033831],
        [0, 49, 2.8734949],
        [1, 0, 0.38425371],
        [1, 1, 1.5918392],
        [1, 2, 1.6590426],
        [1, 3, 0.22036093],
        [1, 4, -0.023381446],
        [1, 5, 0.87233371],
        [1, 6, 2.2467132],
        [1, 7, 0.72433263],
        [1, 8, 1.3563869],
        [1, 9, 0.67084008],
        [1, 10, 0.50894666],
        [1, 11, 0.39953089],
        [1, 12, -0.26853123],
        [1, 13, 0.44947857],
        [1, 14, -0.1124308],
        [1, 15, 1.5362136],
        [1, 16, 0.3649351],
        [1, 17, 1.1137565],
        [1, 18, 0.12997445],
        [1, 19, 0.30395189],
        [1, 20, 0.47743985],
        [1, 21, 0.060313094],
        [1, 22, 1.4565843],
        [1, 23, 0.097143166],
        [1, 24, -0.98200488],
        [1, 25, -1.0557692],
        [1, 26, 1.3013803],
        [1, 27, 0.11992391],
        [1, 28, -0.20376953],
        [1, 29, 2.4164546],
        [1, 30, -0.11912555],
        [1, 31, 0.25206366],
        [1, 32, -0.39422461],
        [1, 33, 0.12509021],
        [1, 34, 0.36464894],
        [1, 35, 1.3368608],
        [1, 36, 0.20974366],
        [1, 37, 1.0040656],
        [1, 38, 0.8825857],
        [1, 39, 1.0310469],
        [1, 40, 0.70382816],
        [1, 41, 0.13618337],
        [1, 42, 0.68550044],
        [1, 43, 0.65628576],
        [1, 44, 0.20443678],
        [1, 45, 0.67299193],
        [1, 46, 1.8147993],
        [1, 47, 1.4106923],
        [1, 48, 0.23313855],
        [1, 49, 1.473443],
        [2, 0, 3.0500226],
        [2, 1, 0.31369069],
        [2, 2, 1.5795195],
        [2, 3, -0.59839779],
        [2, 4, -0.42954165],
        [2, 5, 0.79891586],
        [2, 6, 0.64489985],
        [2, 7, 1.7585329],
        [2, 8, 0.66073573],
        [2, 9, 1.0656096],
        [2, 10, -1.7691597],
        [2, 11, 0.4678328],
        [2, 12, 0.69470876],
        [2, 13, 0.20020477],
        [2, 14, 1.3672364],
        [2, 15, 0.84572911],
        [2, 16, -0.24376109],
        [2, 17, 0.42511722],
        [2, 18, 0.79247773],
        [2, 19, -0.00307748],
        [2, 20, 0.52117211],
        [2, 21, 0.54793054],
        [2, 22, -0.22593045],
        [2, 23, 1.0799345],
        [2, 24, -1.450111],
        [2, 25, -1.1616962],
        [2, 26, 0.87588906],
        [2, 27, 1.4074955],
        [2, 28, 0.15658161],
        [2, 29, 0.56687337],
        [2, 30, 1.3428091],
        [2, 31, 0.23307309],
        [2, 32, -0.48196456],
        [2, 33, 0.54959393],
        [2, 34, 1.2747948],
        [2, 35, 1.2237984],
        [2, 36, -0.70970958],
        [2, 37, 0.77575475],
        [2, 38, 1.6559811],
        [2, 39, -1.371173],
        [2, 40, 0.7670638],
        [2, 41, 1.2840337],
        [2, 42, 0.81409478],
        [2, 43, 0.64454114],
        [2, 44, 0.48419711],
        [2, 45, 1.2027365],
        [2, 46, 2.756896],
        [2, 47, 1.4193524],
        [2, 48, -1.17378],
        [2, 49, 2.7955019],
        [3, 0, 0.59711772],
        [3, 1, 0.41272548],
        [3, 2, 0.080437556],
        [3, 3, 2.8136137],
        [3, 4, 0.40300241],
        [3, 5, 0.72523385],
        [3, 6, 0.62538248],
        [3, 7, 1.3193476],
        [3, 8, 0.33957246],
        [3, 9, 0.10871043],
        [3, 10, 1.0686092],
        [3, 11, 0.71425301],
        [3, 12, 1.2190678],
        [3, 13, 1.3093976],
        [3, 14, 0.39470896],
        [3, 15, 2.0591872],
        [3, 16, -0.23137341],
        [3, 17, 0.67861021],
        [3, 18, 1.6112006],
        [3, 19, 0.66098785],
        [3, 20, 0.50190085],
        [3, 21, 0.14588402],
        [3, 22, 0.85769171],
        [3, 23, 1.3498999],
        [3, 24, 0.87486047],
        [3, 25, 0.77435523],
        [3, 26, 0.42983794],
        [3, 27, 0.98129243],
        [3, 28, 0.83180845],
        [3, 29, 1.0287914],
        [3, 30, 0.59282261],
        [3, 31, -0.12934975],
        [3, 32, 1.7189602],
        [3, 33, 0.26950723],
        [3, 34, 0.77922708],
        [3, 35, 0.8333509],
        [3, 36, -0.10253469],
        [3, 37, -0.14158252],
        [3, 38, -0.10206544],
        [3, 39, 1.2653545],
        [3, 40, 0.22664569],
        [3, 41, 0.00041328045],
        [3, 42, 0.63403577],
        [3, 43, -0.21396829],
        [3, 44, 0.338085],
        [3, 45, 0.48454359],
        [3, 46, 1.0704803],
        [3, 47, 0.26280096],
        [3, 48, 0.14772874],
        [3, 49, 1.0124151],
        [4, 0, 0.97445965],
        [4, 1, -0.27518776],
        [4, 2, 0.54956055],
        [4, 3, -0.07235004],
        [4, 4, 2.4611692],
        [4, 5, 0.26002434],
        [4, 6, -0.79866582],
        [4, 7, -0.52951854],
        [4, 8, 0.092526145],
        [4, 9, -0.41298205],
        [4, 10, 1.1958898],
        [4, 11, -0.57529914],
        [4, 12, -0.92194045],
        [4, 13, 0.35165057],
        [4, 14, -0.50880671],
        [4, 15, -0.90154862],
        [4, 16, 0.66490728],
        [4, 17, 0.57037795],
        [4, 18, 1.287737],
        [4, 19, 0.35143268],
        [4, 20, 1.0316066],
        [4, 21, 0.13518225],
        [4, 22, 1.3031951],
        [4, 23, 0.63886011],
        [4, 24, 0.24000701],
        [4, 25, 0.030834699],
        [4, 26, -0.041708715],
        [4, 27, 0.70808178],
        [4, 28, 0.068501666],
        [4, 29, 0.23006693],
        [4, 30, -0.26748213],
        [4, 31, 0.94266856],
        [4, 32, -0.9316355],
        [4, 33, -0.4548347],
        [4, 34, 0.94476998],
        [4, 35, -0.5762428],
        [4, 36, 0.91017884],
        [4, 37, -0.59517491],
        [4, 38, 1.140638],
        [4, 39, 0.68479365],
        [4, 40, -0.87606937],
        [4, 41, 1.2715212],
        [4, 42, 1.1296781],
        [4, 43, 0.78711206],
        [4, 44, -0.76913685],
        [4, 45, 0.23849392],
        [4, 46, 0.7568956],
        [4, 47, -0.33022723],
        [4, 48, -0.62260592],
        [4, 49, -0.34597266],
        [5, 0, 0.15551864],
        [5, 1, 0.57772338],
        [5, 2, 1.0042048],
        [5, 3, 0.4880043],
        [5, 4, 0.38330558],
        [5, 5, 2.0519249],
        [5, 6, 0.33991873],
        [5, 7, 1.2674936],
        [5, 8, 1.4081168],
        [5, 9, 0.49409381],
        [5, 10, 1.2561352],
        [5, 11, 0.98078066],
        [5, 12, 0.41051874],
        [5, 13, 1.1505153],
        [5, 14, 1.1662369],
        [5, 15, 1.0145515],
        [5, 16, 0.88976926],
        [5, 17, 1.3579661],
        [5, 18, 0.56525952],
        [5, 19, 1.0443065],
        [5, 20, 0.66286492],
        [5, 21, 0.2452915],
        [5, 22, 0.98067623],
        [5, 23, 1.9016709],
        [5, 24, -0.03222983],
        [5, 25, -0.065349646],
        [5, 26, 0.98410654],
        [5, 27, 0.15768802],
        [5, 28, 1.2982799],
        [5, 29, 0.1551701],
        [5, 30, 0.29409015],
        [5, 31, 1.1272273],
        [5, 32, 0.42359149],
        [5, 33, 0.71435356],
        [5, 34, 1.0502751],
        [5, 35, 0.95575589],
        [5, 36, 0.62823296],
        [5, 37, 1.4045855],
        [5, 38, 2.3826556],
        [5, 39, 1.5316794],
        [5, 40, 1.0046231],
        [5, 41, 1.4604167],
        [5, 42, 0.98106253],
        [5, 43, 0.21070115],
        [5, 44, 1.2956316],
        [5, 45, 1.1068312],
        [5, 46, 0.93269861],
        [5, 47, 1.3814209],
        [5, 48, -0.61622429],
        [5, 49, 0.63279736],
        [6, 0, 0.6377942],
        [6, 1, 1.0155439],
        [6, 2, 0.79506046],
        [6, 3, 0.57650656],
        [6, 4, 2.1066957],
        [6, 5, 0.56991559],
        [6, 6, 1.7052727],
        [6, 7, -1.0609027],
        [6, 8, 0.63238245],
        [6, 9, 0.86641133],
        [6, 10, -0.021081313],
        [6, 11, -0.27989671],
        [6, 12, 0.57946372],
        [6, 13, 0.73429495],
        [6, 14, 0.6503008],
        [6, 15, -0.62243104],
        [6, 16, 0.23509069],
        [6, 17, 0.49265248],
        [6, 18, 2.0851874],
        [6, 19, -1.5525205],
        [6, 20, 0.36121842],
        [6, 21, 0.79046905],
        [6, 22, 1.2061721],
        [6, 23, -0.64858413],
        [6, 24, 0.93483961],
        [6, 25, 1.070821],
        [6, 26, 1.2730104],
        [6, 27, -0.042362101],
        [6, 28, 0.2742888],
        [6, 29, 1.8275434],
        [6, 30, -0.092311449],
        [6, 31, 2.1484406],
        [6, 32, 0.15231593],
        [6, 33, 0.68739158],
        [6, 34, 0.34738207],
        [6, 35, 0.7183882],
        [6, 36, 0.65342116],
        [6, 37, 0.61646986],
        [6, 38, 2.2948465],
        [6, 39, 0.54353732],
        [6, 40, 0.61370438],
        [6, 41, 2.9990644],
        [6, 42, 0.67266303],
        [6, 43, 1.0448653],
        [6, 44, -0.32423341],
        [6, 45, 0.035834827],
        [6, 46, 1.2540172],
        [6, 47, 0.21352038],
        [6, 48, 1.0860457],
        [6, 49, 1.6822791],
        [7, 0, 0.058499917],
        [7, 1, -1.7117923],
        [7, 2, -0.023769561],
        [7, 3, -2.1036956],
        [7, 4, -0.64442903],
        [7, 5, 0.148857],
        [7, 6, -0.90677583],
        [7, 7, 2.5467906],
        [7, 8, -0.05016828],
        [7, 9, -1.2515621],
        [7, 10, -0.30520499],
        [7, 11, 0.7821219],
        [7, 12, -0.49889809],
        [7, 13, -0.57118881],
        [7, 14, -0.35720506],
        [7, 15, 0.34217352],
        [7, 16, -0.67062038],
        [7, 17, -0.40368655],
        [7, 18, 0.16650721],
        [7, 19, -1.3922944],
        [7, 20, -1.0842184],
        [7, 21, -1.0405433],
        [7, 22, -1.4474131],
        [7, 23, 0.4240188],
        [7, 24, -0.45294303],
        [7, 25, -0.93671989],
        [7, 26, 0.94103712],
        [7, 27, 0.93983853],
        [7, 28, -0.11058819],
        [7, 29, -0.26696017],
        [7, 30, -0.79452837],
        [7, 31, -0.0087399371],
        [7, 32, 0.027329002],
        [7, 33, -0.39248475],
        [7, 34, -0.83346754],
        [7, 35, 0.93144697],
        [7, 36, -0.47421426],
        [7, 37, -0.61197418],
        [7, 38, 1.4143507],
        [7, 39, -0.49223226],
        [7, 40, 0.34958002],
        [7, 41, 0.66166687],
        [7, 42, 0.49064794],
        [7, 43, -0.57283777],
        [7, 44, 0.8336125],
        [7, 45, -0.175568],
        [7, 46, 1.2631649],
        [7, 47, -1.2655089],
        [7, 48, -1.0224047],
        [7, 49, -1.5262036],
        [8, 0, 1.0467465],
        [8, 1, -0.99140918],
        [8, 2, -1.540012],
        [8, 3, -0.012464195],
        [8, 4, -0.69020492],
        [8, 5, 0.41225678],
        [8, 6, 1.5247825],
        [8, 7, 0.13776655],
        [8, 8, 3.9257061],
        [8, 9, -0.89753091],
        [8, 10, -1.1502954],
        [8, 11, 1.7548727],
        [8, 12, 0.81804681],
        [8, 13, -0.94819015],
        [8, 14, -1.374185],
        [8, 15, 0.026934372],
        [8, 16, 0.38348743],
        [8, 17, -0.93398106],
        [8, 18, 0.67679137],
        [8, 19, -0.43811232],
        [8, 20, -0.26225075],
        [8, 21, -0.69981271],
        [8, 22, -1.1609803],
        [8, 23, 0.24429438],
        [8, 24, -0.29514101],
        [8, 25, -0.056768212],
        [8, 26, 1.0582187],
        [8, 27, -1.2352117],
        [8, 28, 0.44046533],
        [8, 29, -0.83122569],
        [8, 30, 0.39501634],
        [8, 31, 0.6413064],
        [8, 32, -0.15433399],
        [8, 33, 0.78563923],
        [8, 34, -0.23582955],
        [8, 35, 1.2914077],
        [8, 36, 0.037024841],
        [8, 37, 0.90510309],
        [8, 38, 0.88703084],
        [8, 39, 1.0452248],
        [8, 40, 0.72979677],
        [8, 41, -0.56260145],
        [8, 42, 1.0686808],
        [8, 43, -0.3248972],
        [8, 44, 1.4040717],
        [8, 45, 0.34333077],
        [8, 46, -0.75167316],
        [8, 47, 0.87654942],
        [8, 48, 0.66444212],
        [8, 49, 1.5272943],
        [9, 0, 1.1855122],
        [9, 1, 0.3038969],
        [9, 2, 0.49408904],
        [9, 3, -1.3702224],
        [9, 4, 0.62696195],
        [9, 5, 0.9414624],
        [9, 6, 1.3314822],
        [9, 7, 1.8919775],
        [9, 8, 1.0186963],
        [9, 9, 1.9721662],
        [9, 10, 0.54562801],
        [9, 11, 1.0627086],
        [9, 12, -0.36327299],
        [9, 13, 1.1615311],
        [9, 14, 1.2310528],
        [9, 15, -1.0036911],
        [9, 16, 0.82076591],
        [9, 17, 0.14064822],
        [9, 18, 1.9532424],
        [9, 19, 0.582358],
        [9, 20, 1.0753132],
        [9, 21, 0.23564832],
        [9, 22, 1.7553353],
        [9, 23, 0.39547729],
        [9, 24, 1.1780393],
        [9, 25, 1.2565217],
        [9, 26, 1.4897267],
        [9, 27, 2.3282499],
        [9, 28, 0.59354162],
        [9, 29, 0.13883896],
        [9, 30, 0.61819088],
        [9, 31, -0.78662789],
        [9, 32, 0.63896233],
        [9, 33, 0.17610596],
        [9, 34, 0.24207108],
        [9, 35, 2.1139996],
        [9, 36, 0.26338378],
        [9, 37, 0.090111881],
        [9, 38, 1.367539],
        [9, 39, 1.2022511],
        [9, 40, 1.236737],
        [9, 41, -0.22514048],
        [9, 42, 1.2292955],
        [9, 43, 0.43429235],
        [9, 44, 0.73368502],
        [9, 45, 0.22555012],
        [9, 46, 2.6829534],
        [9, 47, 0.49814266],
        [9, 48, -0.75457436],
        [9, 49, 1.0820605],
        [10, 0, 1.3868988],
        [10, 1, -0.60423744],
        [10, 2, 1.1293901],
        [10, 3, 0.0024690221],
        [10, 4, -1.2485715],
        [10, 5, -0.17469309],
        [10, 6, -1.3644269],
        [10, 7, 0.91335899],
        [10, 8, 0.87035877],
        [10, 9, -0.26407632],
        [10, 10, 0.087152787],
        [10, 11, -0.57652086],
        [10, 12, 0.39330217],
        [10, 13, -1.1372935],
        [10, 14, -0.50430876],
        [10, 15, 0.63982266],
        [10, 16, -0.44035074],
        [10, 17, 0.089833751],
        [10, 18, 0.25523457],
        [10, 19, 1.0337694],
        [10, 20, 0.89836615],
        [10, 21, -0.28926262],
        [10, 22, 0.28025255],
        [10, 23, 0.53540671],
        [10, 24, -0.91975039],
        [10, 25, -0.6601066],
        [10, 26, 1.1410292],
        [10, 27, 0.62870765],
        [10, 28, -0.2562528],
        [10, 29, -0.48976576],
        [10, 30, 0.065014452],
        [10, 31, 0.66406339],
        [10, 32, 0.80906761],
        [10, 33, 0.64856964],
        [10, 34, -1.0755744],
        [10, 35, 1.8111633],
        [10, 36, -0.85571152],
        [10, 37, 1.0216191],
        [10, 38, -0.16813999],
        [10, 39, -0.72902459],
        [10, 40, -0.12570015],
        [10, 41, 0.63682657],
        [10, 42, 0.18292174],
        [10, 43, -0.013776428],
        [10, 44, -0.46969134],
        [10, 45, 0.07289432],
        [10, 46, 1.0483124],
        [10, 47, 0.99612683],
        [10, 48, -0.74388003],
        [10, 49, 1.2957097],
        [11, 0, 0.086476892],
        [11, 1, 0.52534747],
        [11, 2, -0.17174603],
        [11, 3, -1.3536576],
        [11, 4, 1.5572132],
        [11, 5, -0.1972418],
        [11, 6, -0.18782088],
        [11, 7, -0.24116518],
        [11, 8, 1.8199272],
        [11, 9, 0.74588162],
        [11, 10, 0.905173],
        [11, 11, 2.4410698],
        [11, 12, 0.22303683],
        [11, 13, 0.85676271],
        [11, 14, 0.29505864],
        [11, 15, 0.030735705],
        [11, 16, -0.21985573],
        [11, 17, -0.77357972],
        [11, 18, 0.76706439],
        [11, 19, -1.0379407],
        [11, 20, -0.01408612],
        [11, 21, -0.47709376],
        [11, 22, 0.13976972],
        [11, 23, -0.23311265],
        [11, 24, 0.42774114],
        [11, 25, 0.36461258],
        [11, 26, 0.26802889],
        [11, 27, 0.13743137],
        [11, 28, 0.26716813],
        [11, 29, 0.67253911],
        [11, 30, 0.11125238],
        [11, 31, 0.28366157],
        [11, 32, 0.75436234],
        [11, 33, 0.62700248],
        [11, 34, -0.70405382],
        [11, 35, 1.0007174],
        [11, 36, 0.65027004],
        [11, 37, -0.70366168],
        [11, 38, 1.2950255],
        [11, 39, 1.1240944],
        [11, 40, 0.97404784],
        [11, 41, 0.097833991],
        [11, 42, 1.3883531],
        [11, 43, -0.44997603],
        [11, 44, 1.7063121],
        [11, 45, -0.52711952],
        [11, 46, 1.8720628],
        [11, 47, -1.067187],
        [11, 48, 0.92762464],
        [11, 49, 0.0090106353],
        [12, 0, 0.39108822],
        [12, 1, 0.089128464],
        [12, 2, -0.40693131],
        [12, 3, -0.13291642],
        [12, 4, -0.26298943],
        [12, 5, 0.60658509],
        [12, 6, -0.2875855],
        [12, 7, 1.1958801],
        [12, 8, -0.22677697],
        [12, 9, 0.9870488],
        [12, 10, -1.0253234],
        [12, 11, 0.048439108],
        [12, 12, -0.23464078],
        [12, 13, 0.6912306],
        [12, 14, -0.60963929],
        [12, 15, 0.10410409],
        [12, 16, 0.0018738648],
        [12, 17, -0.44539919],
        [12, 18, -0.033815749],
        [12, 19, 0.32534128],
        [12, 20, -0.60411906],
        [12, 21, -0.53213614],
        [12, 22, -0.043881517],
        [12, 23, 0.73282933],
        [12, 24, 0.80159962],
        [12, 25, 0.98658836],
        [12, 26, -0.013406298],
        [12, 27, 1.0175698],
        [12, 28, 0.29909351],
        [12, 29, 0.21948151],
        [12, 30, -0.49009955],
        [12, 31, -1.2828052],
        [12, 32, 1.4741051],
        [12, 33, 0.12158415],
        [12, 34, -0.75971907],
        [12, 35, 0.047515932],
        [12, 36, -0.22315367],
        [12, 37, -0.22129519],
        [12, 38, 0.47559789],
        [12, 39, -0.94887489],
        [12, 40, -0.006158723],
        [12, 41, 0.55767041],
        [12, 42, 0.89141673],
        [12, 43, -0.79159904],
        [12, 44, -0.20483047],
        [12, 45, 0.22202145],
        [12, 46, 1.4838518],
        [12, 47, 0.3231554],
        [12, 48, 0.16734745],
        [12, 49, 0.56726855],
        [13, 0, -0.037218839],
        [13, 1, -1.0454805],
        [13, 2, 0.74585569],
        [13, 3, -0.42873549],
        [13, 4, 0.013544119],
        [13, 5, 0.69735342],
        [13, 6, 1.1215397],
        [13, 7, 0.71357363],
        [13, 8, 0.24003671],
        [13, 9, -0.27946895],
        [13, 10, -0.047398053],
        [13, 11, 0.69294256],
        [13, 12, 0.55329263],
        [13, 13, 1.9676762],
        [13, 14, 0.15383366],
        [13, 15, -0.78489995],
        [13, 16, 0.17607155],
        [13, 17, 1.0152826],
        [13, 18, 0.66354102],
        [13, 19, -0.32936451],
        [13, 20, 0.026483038],
        [13, 21, -0.63834536],
        [13, 22, 0.67407143],
        [13, 23, 0.42538705],
        [13, 24, -0.048981011],
        [13, 25, -0.45384803],
        [13, 26, 0.77754313],
        [13, 27, 1.5447381],
        [13, 28, -1.0852983],
        [13, 29, -0.65245342],
        [13, 30, 0.15756235],
        [13, 31, 0.77773023],
        [13, 32, -1.6816845],
        [13, 33, 0.46997324],
        [13, 34, -0.21440147],
        [13, 35, 0.70818341],
        [13, 36, 0.056182545],
        [13, 37, 1.3334028],
        [13, 38, 0.55282372],
        [13, 39, 0.46059331],
        [13, 40, 0.86456829],
        [13, 41, 0.97828716],
        [13, 42, 1.0194372],
        [13, 43, -0.072841682],
        [13, 44, 0.33303905],
        [13, 45, 0.53458828],
        [13, 46, 1.462656],
        [13, 47, 1.4075452],
        [13, 48, 0.61858225],
        [13, 49, 0.95252466],
        [14, 0, -0.53573656],
        [14, 1, 1.1381987],
        [14, 2, 1.8928713],
        [14, 3, 1.0063112],
        [14, 4, 0.98975146],
        [14, 5, 0.86528933],
        [14, 6, 2.0766525],
        [14, 7, 1.5771664],
        [14, 8, 0.35790703],
        [14, 9, 1.3637205],
        [14, 10, -0.16081777],
        [14, 11, 0.58752954],
        [14, 12, 0.67003846],
        [14, 13, 1.1575552],
        [14, 14, 1.1125546],
        [14, 15, 1.9080446],
        [14, 16, 0.51389575],
        [14, 17, 1.2242593],
        [14, 18, 0.81212837],
        [14, 19, 0.73230129],
        [14, 20, 0.62599522],
        [14, 21, -1.3172919],
        [14, 22, 0.51302457],
        [14, 23, 1.2934715],
        [14, 24, 1.1958729],
        [14, 25, 1.0057918],
        [14, 26, 0.80832934],
        [14, 27, -0.62174457],
        [14, 28, -0.048818432],
        [14, 29, 0.90498817],
        [14, 30, 1.6203316],
        [14, 31, 0.31118357],
        [14, 32, -0.5434944],
        [14, 33, 1.039472],
        [14, 34, 0.69572884],
        [14, 35, 1.2554898],
        [14, 36, 0.63003635],
        [14, 37, 0.41699848],
        [14, 38, 1.3356228],
        [14, 39, 0.006320863],
        [14, 40, 0.29342574],
        [14, 41, 0.88624507],
        [14, 42, 1.4544493],
        [14, 43, -1.2962404],
        [14, 44, 0.1026024],
        [14, 45, 1.5855466],
        [14, 46, 2.3073909],
        [14, 47, 0.5033586],
        [14, 48, 0.10056212],
        [14, 49, 1.1157863],
        [15, 0, 0.74149221],
        [15, 1, 0.53015745],
        [15, 2, 2.3026969],
        [15, 3, 0.5112642],
        [15, 4, 0.8777585],
        [15, 5, 0.56623304],
        [15, 6, -1.1658188],
        [15, 7, 0.54288274],
        [15, 8, 0.73372233],
        [15, 9, 0.55593407],
        [15, 10, 0.95840412],
        [15, 11, -0.0022121652],
        [15, 12, 0.85504973],
        [15, 13, 1.5633258],
        [15, 14, -0.24182965],
        [15, 15, 3.1439815],
        [15, 16, -0.081272259],
        [15, 17, 0.5722121],
        [15, 18, 0.12365021],
        [15, 19, 0.38502041],
        [15, 20, 0.50794387],
        [15, 21, 0.12021506],
        [15, 22, 0.64470452],
        [15, 23, 0.77221262],
        [15, 24, 0.51997864],
        [15, 25, 0.55790889],
        [15, 26, 0.61512494],
        [15, 27, -0.43892184],
        [15, 28, 0.89548814],
        [15, 29, 0.3038722],
        [15, 30, -0.6820423],
        [15, 31, 0.04584793],
        [15, 32, 1.5877769],
        [15, 33, 0.25089666],
        [15, 34, 0.16949379],
        [15, 35, 0.0031142682],
        [15, 36, 0.38138103],
        [15, 37, 0.93177623],
        [15, 38, -0.1674189],
        [15, 39, 0.55975324],
        [15, 40, 0.089659274],
        [15, 41, 0.20410992],
        [15, 42, -0.20980804],
        [15, 43, -0.036973245],
        [15, 44, -0.19633283],
        [15, 45, 1.6911657],
        [15, 46, 1.8361031],
        [15, 47, 0.92068928],
        [15, 48, 0.16609278],
        [15, 49, 2.1422009],
        [16, 0, 0.18556955],
        [16, 1, -0.31118053],
        [16, 2, 0.30352235],
        [16, 3, -0.32528487],
        [16, 4, 0.81944555],
        [16, 5, 0.97580934],
        [16, 6, 0.2365327],
        [16, 7, 0.069264568],
        [16, 8, 1.8154236],
        [16, 9, 0.3804999],
        [16, 10, 0.35576892],
        [16, 11, -0.46947294],
        [16, 12, -0.98343611],
        [16, 13, 1.3962351],
        [16, 14, 1.101239],
        [16, 15, -1.4164178],
        [16, 16, 2.2927558],
        [16, 17, 0.77806085],
        [16, 18, 0.78851616],
        [16, 19, 0.94310343],
        [16, 20, 2.1126566],
        [16, 21, -0.10116203],
        [16, 22, 2.4159412],
        [16, 23, 1.3413378],
        [16, 24, -0.32630056],
        [16, 25, -0.046925381],
        [16, 26, 0.87862045],
        [16, 27, -0.42075312],
        [16, 28, -0.10781334],
        [16, 29, 0.63379699],
        [16, 30, 0.30073377],
        [16, 31, -0.31515938],
        [16, 32, 0.23188441],
        [16, 33, 0.59027827],
        [16, 34, 1.2106473],
        [16, 35, 1.4552625],
        [16, 36, 0.67592871],
        [16, 37, 0.4373382],
        [16, 38, 1.7313324],
        [16, 39, 0.96485561],
        [16, 40, -0.24358585],
        [16, 41, 0.75491321],
        [16, 42, 0.29698637],
        [16, 43, -0.33713531],
        [16, 44, -0.69980299],
        [16, 45, 0.59805983],
        [16, 46, 0.54961032],
        [16, 47, 0.69552875],
        [16, 48, 0.53497183],
        [16, 49, 0.34353423],
        [17, 0, 0.81867921],
        [17, 1, 0.59147716],
        [17, 2, 1.6178015],
        [17, 3, -0.96108407],
        [17, 4, 0.17782046],
        [17, 5, 0.73618311],
        [17, 6, -0.71139741],
        [17, 7, -0.18865268],
        [17, 8, 1.666469],
        [17, 9, 1.1998936],
        [17, 10, 0.63589853],
        [17, 11, 1.0306654],
        [17, 12, 0.094190538],
        [17, 13, 1.4046785],
        [17, 14, -0.37366858],
        [17, 15, 0.41712791],
        [17, 16, 0.47244164],
        [17, 17, 2.2546868],
        [17, 18, 0.15509094],
        [17, 19, 0.077758484],
        [17, 20, 0.17836945],
        [17, 21, 0.15120314],
        [17, 22, 0.41527882],
        [17, 23, -0.081740119],
        [17, 24, -0.79709381],
        [17, 25, -0.59707028],
        [17, 26, 0.92955106],
        [17, 27, -0.17671938],
        [17, 28, 1.8793323],
        [17, 29, -0.18398018],
        [17, 30, 0.56093949],
        [17, 31, 0.75951391],
        [17, 32, -1.168033],
        [17, 33, 0.3972199],
        [17, 34, 0.60740775],
        [17, 35, 0.99593365],
        [17, 36, 0.39121783],
        [17, 37, 1.2718936],
        [17, 38, 1.0183825],
        [17, 39, 0.67097777],
        [17, 40, 0.91251421],
        [17, 41, 0.44091281],
        [17, 42, 0.89981484],
        [17, 43, 0.37518033],
        [17, 44, 1.176811],
        [17, 45, 0.59761035],
        [17, 46, 1.1582172],
        [17, 47, 1.2083465],
        [17, 48, -1.030684],
        [17, 49, 0.35892245],
        [18, 0, -0.077594399],
        [18, 1, 0.58823413],
        [18, 2, 0.39709142],
        [18, 3, 0.52537084],
        [18, 4, -0.05723628],
        [18, 5, 0.19941291],
        [18, 6, 1.000368],
        [18, 7, 1.5076967],
        [18, 8, 1.3868068],
        [18, 9, 0.49200878],
        [18, 10, 0.79086143],
        [18, 11, 0.41992378],
        [18, 12, 0.98185515],
        [18, 13, -0.13256848],
        [18, 14, 0.85887218],
        [18, 15, 0.32137689],
        [18, 16, 0.2165738],
        [18, 17, 0.64133734],
        [18, 18, 2.7429316],
        [18, 19, -0.79822087],
        [18, 20, 0.23263972],
        [18, 21, 0.071405053],
        [18, 22, 0.16939797],
        [18, 23, 0.066308267],
        [18, 24, -2.0745692],
        [18, 25, -1.7945472],
        [18, 26, 0.9764266],
        [18, 27, 0.28178605],
        [18, 28, -0.38320839],
        [18, 29, 0.45823282],
        [18, 30, 0.56647694],
        [18, 31, 0.15933165],
        [18, 32, 0.29636928],
        [18, 33, 1.0471702],
        [18, 34, 0.17283393],
        [18, 35, 1.3375669],
        [18, 36, -0.33580464],
        [18, 37, 1.2372497],
        [18, 38, 1.3914195],
        [18, 39, 1.2535772],
        [18, 40, 0.45656356],
        [18, 41, -0.59655219],
        [18, 42, 0.58935106],
        [18, 43, 0.24234983],
        [18, 44, 1.0890214],
        [18, 45, 0.40120104],
        [18, 46, 0.22939496],
        [18, 47, 0.54140931],
        [18, 48, -0.55724573],
        [18, 49, 1.6976233],
        [19, 0, 0.21080434],
        [19, 1, -0.68433434],
        [19, 2, -0.46206081],
        [19, 3, 0.081792206],
        [19, 4, -0.17582442],
        [19, 5, 0.61073053],
        [19, 6, 2.1933844],
        [19, 7, 1.2266983],
        [19, 8, -0.2071337],
        [19, 9, 0.15544473],
        [19, 10, 0.11647895],
        [19, 11, 0.28939],
        [19, 12, -0.45734105],
        [19, 13, 0.086177357],
        [19, 14, 0.51879877],
        [19, 15, -0.41186166],
        [19, 16, -0.3454842],
        [19, 17, 0.86149877],
        [19, 18, 1.2343241],
        [19, 19, -0.22343597],
        [19, 20, 0.76268339],
        [19, 21, -0.64567828],
        [19, 22, 0.91262972],
        [19, 23, 1.3655034],
        [19, 24, 2.0524125],
        [19, 25, 1.7506249],
        [19, 26, 0.61419469],
        [19, 27, 1.0140662],
        [19, 28, 0.45028332],
        [19, 29, -1.1594226],
        [19, 30, -0.80589598],
        [19, 31, 1.3275254],
        [19, 32, -0.026329853],
        [19, 33, 0.66351688],
        [19, 34, -0.51286024],
        [19, 35, 1.1973625],
        [19, 36, -0.20290378],
        [19, 37, 0.054889094],
        [19, 38, 1.1540107],
        [19, 39, 1.4385403],
        [19, 40, 0.075136729],
        [19, 41, 1.303275],
        [19, 42, 1.7592188],
        [19, 43, -0.97682685],
        [19, 44, 0.47210771],
        [19, 45, 0.61259991],
        [19, 46, 0.86620748],
        [19, 47, 0.19275993],
        [19, 48, -0.20161638],
        [19, 49, 1.0802132],
        [20, 0, 1.7373677],
        [20, 1, -0.88039833],
        [20, 2, 0.54324573],
        [20, 3, -0.75985616],
        [20, 4, 0.79141241],
        [20, 5, 0.95714206],
        [20, 6, 0.72778827],
        [20, 7, 1.3784108],
        [20, 8, 0.70072001],
        [20, 9, 0.16887361],
        [20, 10, 0.31966284],
        [20, 11, 1.3288893],
        [20, 12, -0.45233211],
        [20, 13, 0.3553848],
        [20, 14, 1.0155277],
        [20, 15, -0.14235236],
        [20, 16, 0.82401204],
        [20, 17, 0.17974237],
        [20, 18, 1.3106744],
        [20, 19, 0.36924285],
        [20, 20, 1.9072753],
        [20, 21, 0.33943474],
        [20, 22, 0.97829008],
        [20, 23, 0.53836107],
        [20, 24, 0.93785644],
        [20, 25, 0.7577343],
        [20, 26, 0.65007877],
        [20, 27, 2.6307135],
        [20, 28, 1.1466484],
        [20, 29, -0.303431],
        [20, 30, 0.7984888],
        [20, 31, 1.1909504],
        [20, 32, 0.46621028],
        [20, 33, 0.36850035],
        [20, 34, 0.3612611],
        [20, 35, 0.68450546],
        [20, 36, 0.86904538],
        [20, 37, -0.41545245],
        [20, 38, 1.1538708],
        [20, 39, 1.0878719],
        [20, 40, 0.99484164],
        [20, 41, 0.48098275],
        [20, 42, 1.6506172],
        [20, 43, 0.29183304],
        [20, 44, 0.94491339],
        [20, 45, 0.41663429],
        [20, 46, 1.4023132],
        [20, 47, 0.32695016],
        [20, 48, -0.55853659],
        [20, 49, 0.28584236],
        [21, 0, 0.47387278],
        [21, 1, -0.25581753],
        [21, 2, 0.69397891],
        [21, 3, -0.12772255],
        [21, 4, -0.41628781],
        [21, 5, -0.13010937],
        [21, 6, 0.028793966],
        [21, 7, 0.45892578],
        [21, 8, 1.2316769],
        [21, 9, -0.47049594],
        [21, 10, -0.1507145],
        [21, 11, -0.61072499],
        [21, 12, 0.30988151],
        [21, 13, -0.10413881],
        [21, 14, -1.4048189],
        [21, 15, 1.1553155],
        [21, 16, 0.020325227],
        [21, 17, -0.010605753],
        [21, 18, -0.27972612],
        [21, 19, 1.0467988],
        [21, 20, 0.80650836],
        [21, 21, 0.35550526],
        [21, 22, 0.72874182],
        [21, 23, 0.1490369],
        [21, 24, -0.7040481],
        [21, 25, -0.91490102],
        [21, 26, 0.5227989],
        [21, 27, 0.79840183],
        [21, 28, 0.50510341],
        [21, 29, 0.38840005],
        [21, 30, -0.38760278],
        [21, 31, 0.43585676],
        [21, 32, 0.11985644],
        [21, 33, -0.14149199],
        [21, 34, -0.96559447],
        [21, 35, 0.46584857],
        [21, 36, -0.17076035],
        [21, 37, 0.13858561],
        [21, 38, -0.43855259],
        [21, 39, -0.29282907],
        [21, 40, -0.48646653],
        [21, 41, 0.075671606],
        [21, 42, 0.35704726],
        [21, 43, -0.081924066],
        [21, 44, -0.27056161],
        [21, 45, -0.17110723],
        [21, 46, 0.64634717],
        [21, 47, 0.17250882],
        [21, 48, 0.084927246],
        [21, 49, 0.91757292],
        [22, 0, 1.7444775],
        [22, 1, -0.16968334],
        [22, 2, -0.23323105],
        [22, 3, 0.52851194],
        [22, 4, 0.65248716],
        [22, 5, 0.64867181],
        [22, 6, 0.36236811],
        [22, 7, 0.5768649],
        [22, 8, 1.0366603],
        [22, 9, 0.64740157],
        [22, 10, 0.52252561],
        [22, 11, 0.16186696],
        [22, 12, 0.70151234],
        [22, 13, 0.32339191],
        [22, 14, 0.74600381],
        [22, 15, -0.17742823],
        [22, 16, 0.83078146],
        [22, 17, -0.14689241],
        [22, 18, 1.1272511],
        [22, 19, 1.3037045],
        [22, 20, 1.1285776],
        [22, 21, 0.89166552],
        [22, 22, 1.6370827],
        [22, 23, 0.85858786],
        [22, 24, 1.1685899],
        [22, 25, 0.89165568],
        [22, 26, 1.0946876],
        [22, 27, 2.8676999],
        [22, 28, 1.7907081],
        [22, 29, 0.16290542],
        [22, 30, -0.024253013],
        [22, 31, 1.4259936],
        [22, 32, 0.49467182],
        [22, 33, -0.029390529],
        [22, 34, 1.4191247],
        [22, 35, 0.55244309],
        [22, 36, 0.50827146],
        [22, 37, -0.26971352],
        [22, 38, 1.6402441],
        [22, 39, 1.2493715],
        [22, 40, -0.054671612],
        [22, 41, 1.8341004],
        [22, 42, 1.2058606],
        [22, 43, 1.1707808],
        [22, 44, 0.21439196],
        [22, 45, 0.35623226],
        [22, 46, 1.1723781],
        [22, 47, 0.78391707],
        [22, 48, 0.36550581],
        [22, 49, -0.02782573],
        [23, 0, 0.96138829],
        [23, 1, 0.1668694],
        [23, 2, 0.34251681],
        [23, 3, 0.43457714],
        [23, 4, 0.40234202],
        [23, 5, 0.21779931],
        [23, 6, -0.088720813],
        [23, 7, 0.5573411],
        [23, 8, 0.61529624],
        [23, 9, 0.47759002],
        [23, 10, -0.1534943],
        [23, 11, 1.4682146],
        [23, 12, 0.65251774],
        [23, 13, 0.61852384],
        [23, 14, 0.26454636],
        [23, 15, 0.82629269],
        [23, 16, 0.39194512],
        [23, 17, -0.31244609],
        [23, 18, 0.33705732],
        [23, 19, 0.19890901],
        [23, 20, 0.16551596],
        [23, 21, -0.47763202],
        [23, 22, -0.15124403],
        [23, 23, 1.5835531],
        [23, 24, 0.28397727],
        [23, 25, 0.24258307],
        [23, 26, 0.87771302],
        [23, 27, -0.14635277],
        [23, 28, 0.18449134],
        [23, 29, 1.2951573],
        [23, 30, 0.2437678],
        [23, 31, -0.017262457],
        [23, 32, 0.51554376],
        [23, 33, 0.66473997],
        [23, 34, 0.023041604],
        [23, 35, 0.96606988],
        [23, 36, 1.0257692],
        [23, 37, 0.37490168],
        [23, 38, 1.2044296],
        [23, 39, 0.31159273],
        [23, 40, 0.92372143],
        [23, 41, 0.85239196],
        [23, 42, 1.5036904],
        [23, 43, 0.075734936],
        [23, 44, 1.5183609],
        [23, 45, 0.45232522],
        [23, 46, 0.38403779],
        [23, 47, 0.070775002],
        [23, 48, 1.0442379],
        [23, 49, 0.71884239],
        [24, 0, 0.77695549],
        [24, 1, 1.0651042],
        [24, 2, -0.24740176],
        [24, 3, 1.6705698],
        [24, 4, 0.87688231],
        [24, 5, 0.33777484],
        [24, 6, 1.2763182],
        [24, 7, 1.2894808],
        [24, 8, 0.21940784],
        [24, 9, 1.0163292],
        [24, 10, 0.54502362],
        [24, 11, 0.93403542],
        [24, 12, 1.8018392],
        [24, 13, 0.67526507],
        [24, 14, 0.23304364],
        [24, 15, -0.62667358],
        [24, 16, -0.1284145],
        [24, 17, 0.0083243335],
        [24, 18, 0.50527626],
        [24, 19, -0.13795502],
        [24, 20, 1.0642166],
        [24, 21, -0.19756763],
        [24, 22, 2.1296713],
        [24, 23, 0.68259406],
        [24, 24, 2.8679426],
        [24, 25, 2.1155224],
        [24, 26, 1.4846637],
        [24, 27, 0.97598815],
        [24, 28, -0.96733099],
        [24, 29, 1.3570093],
        [24, 30, 0.48983184],
        [24, 31, 0.82353431],
        [24, 32, -0.96409148],
        [24, 33, 0.96148765],
        [24, 34, 0.071116596],
        [24, 35, 1.4289163],
        [24, 36, -0.10138512],
        [24, 37, 2.0026727],
        [24, 38, 1.7625332],
        [24, 39, 0.7506513],
        [24, 40, 0.65950245],
        [24, 41, 2.1422346],
        [24, 42, 1.7895784],
        [24, 43, 0.60383797],
        [24, 44, 0.82807553],
        [24, 45, 0.1676677],
        [24, 46, 0.78825873],
        [24, 47, 1.7156844],
        [24, 48, 0.19495517],
        [24, 49, 2.6078784],
        [25, 0, 1.3455294],
        [25, 1, 0.38689238],
        [25, 2, 0.704009],
        [25, 3, 1.3572259],
        [25, 4, 1.080518],
        [25, 5, 0.72798848],
        [25, 6, 1.4432564],
        [25, 7, 0.9017846],
        [25, 8, 0.80968601],
        [25, 9, 0.18220937],
        [25, 10, 0.28952473],
        [25, 11, 0.77758962],
        [25, 12, 2.223453],
        [25, 13, 0.73386848],
        [25, 14, 0.48888656],
        [25, 15, -0.13485348],
        [25, 16, 0.41271028],
        [25, 17, 0.50700068],
        [25, 18, 1.1427196],
        [25, 19, -0.34427732],
        [25, 20, 1.5222719],
        [25, 21, -0.0064444556],
        [25, 22, 1.4603307],
        [25, 23, 0.69453478],
        [25, 24, 1.7140435],
        [25, 25, 2.0317874],
        [25, 26, 1.7012261],
        [25, 27, 0.36794734],
        [25, 28, -0.91216034],
        [25, 29, 0.47260064],
        [25, 30, 1.4115984],
        [25, 31, 0.54114711],
        [25, 32, -0.03956439],
        [25, 33, 1.5170907],
        [25, 34, -0.001744449],
        [25, 35, 1.9695415],
        [25, 36, 0.46450362],
        [25, 37, 2.6656871],
        [25, 38, 1.9873842],
        [25, 39, 0.72658145],
        [25, 40, 0.33900997],
        [25, 41, 2.1717768],
        [25, 42, 1.7323045],
        [25, 43, 0.95505762],
        [25, 44, 0.76388013],
        [25, 45, 0.24940707],
        [25, 46, 1.4806761],
        [25, 47, 2.33428],
        [25, 48, 0.88822448],
        [25, 49, 3.2080276],
        [26, 0, 0.2785565],
        [26, 1, -1.1936561],
        [26, 2, 0.49578178],
        [26, 3, -0.86392808],
        [26, 4, -0.33128422],
        [26, 5, -0.28419796],
        [26, 6, -0.78726935],
        [26, 7, -0.57805818],
        [26, 8, 1.5762721],
        [26, 9, -1.5866865],
        [26, 10, -0.25438651],
        [26, 11, 1.4981804],
        [26, 12, 0.3593739],
        [26, 13, 1.6280105],
        [26, 14, -0.70747453],
        [26, 15, 0.20706609],
        [26, 16, 0.13332263],
        [26, 17, -0.39526397],
        [26, 18, -0.15760063],
        [26, 19, 0.33550954],
        [26, 20, -0.65051329],
        [26, 21, -1.2681571],
        [26, 22, -1.2557762],
        [26, 23, 0.50687414],
        [26, 24, -0.73705745],
        [26, 25, -0.63724226],
        [26, 26, 1.4066368],
        [26, 27, 0.14753827],
        [26, 28, 0.5040018],
        [26, 29, 0.09076307],
        [26, 30, -0.95732778],
        [26, 31, 1.0684588],
        [26, 32, -1.2743739],
        [26, 33, -0.0044507091],
        [26, 34, 0.24938573],
        [26, 35, 0.037540615],
        [26, 36, 0.32497519],
        [26, 37, 0.69678825],
        [26, 38, 1.2326058],
        [26, 39, 0.79919481],
        [26, 40, 0.77354258],
        [26, 41, 0.59825933],
        [26, 42, 0.45884565],
        [26, 43, -0.58950871],
        [26, 44, 1.7793508],
        [26, 45, 0.45454299],
        [26, 46, 0.43033034],
        [26, 47, 0.48690173],
        [26, 48, 1.2006814],
        [26, 49, 0.061531287],
        [27, 0, -0.19001938],
        [27, 1, 0.80653369],
        [27, 2, 0.12471715],
        [27, 3, -1.2720206],
        [27, 4, -0.15435633],
        [27, 5, 0.21750224],
        [27, 6, 0.41430143],
        [27, 7, 1.3747321],
        [27, 8, 1.7177877],
        [27, 9, 1.1065056],
        [27, 10, 0.58227152],
        [27, 11, 0.55411017],
        [27, 12, 0.15255071],
        [27, 13, 0.87969375],
        [27, 14, -0.0026766593],
        [27, 15, 1.7111523],
        [27, 16, 0.41926292],
        [27, 17, 0.41937613],
        [27, 18, -1.0026411],
        [27, 19, -0.87515599],
        [27, 20, -0.15892927],
        [27, 21, -0.24658878],
        [27, 22, 0.40748164],
        [27, 23, -0.32627225],
        [27, 24, -0.8295061],
        [27, 25, -1.3899875],
        [27, 26, 0.81902736],
        [27, 27, 0.96343338],
        [27, 28, -1.1600432],
        [27, 29, -0.15881543],
        [27, 30, -0.9888708],
        [27, 31, 0.42460048],
        [27, 32, 0.24111897],
        [27, 33, 0.7149502],
        [27, 34, 0.046081651],
        [27, 35, 0.63034487],
        [27, 36, 0.52400619],
        [27, 37, 0.66641819],
        [27, 38, 0.36808506],
        [27, 39, 0.72113323],
        [27, 40, 1.006027],
        [27, 41, 0.042668629],
        [27, 42, 0.95592493],
        [27, 43, -0.59780055],
        [27, 44, 0.73764288],
        [27, 45, 0.82865542],
        [27, 46, -0.14787021],
        [27, 47, 0.21132669],
        [27, 48, -0.013674039],
        [27, 49, 1.3976601],
        [28, 0, 0.81289291],
        [28, 1, -0.64075893],
        [28, 2, 1.7184554],
        [28, 3, 0.16282852],
        [28, 4, 1.3820964],
        [28, 5, 0.2080929],
        [28, 6, 1.6556251],
        [28, 7, 0.50212854],
        [28, 8, 0.88505155],
        [28, 9, -0.80757564],
        [28, 10, 0.78867573],
        [28, 11, -0.14267769],
        [28, 12, 1.0932437],
        [28, 13, 0.075700238],
        [28, 14, 1.9229287],
        [28, 15, -0.45748878],
        [28, 16, 0.10402419],
        [28, 17, 0.26425841],
        [28, 18, 1.1876584],
        [28, 19, 0.083454393],
        [28, 20, 0.53483707],
        [28, 21, -0.80935776],
        [28, 22, 0.63941091],
        [28, 23, 0.09612529],
        [28, 24, 0.12894559],
        [28, 25, 0.30095544],
        [28, 26, 1.2383275],
        [28, 27, -1.2650213],
        [28, 28, 1.6506913],
        [28, 29, -0.85753012],
        [28, 30, -0.26764804],
        [28, 31, 1.0906818],
        [28, 32, -0.03604589],
        [28, 33, 0.93460262],
        [28, 34, 0.71526939],
        [28, 35, 0.71983737],
        [28, 36, 0.17812771],
        [28, 37, 0.75029898],
        [28, 38, 0.50036228],
        [28, 39, 1.6175562],
        [28, 40, -0.56204355],
        [28, 41, 0.49182865],
        [28, 42, 0.63113475],
        [28, 43, -0.26447907],
        [28, 44, 0.082942851],
        [28, 45, 0.23089996],
        [28, 46, 1.021276],
        [28, 47, 0.84402615],
        [28, 48, 1.4713267],
        [28, 49, 3.1179152],
        [29, 0, 0.035066478],
        [29, 1, 0.95606226],
        [29, 2, 0.02048016],
        [29, 3, 0.1318915],
        [29, 4, -1.1848581],
        [29, 5, 0.41309339],
        [29, 6, 1.8252555],
        [29, 7, -0.12137069],
        [29, 8, 0.28019282],
        [29, 9, 0.60326409],
        [29, 10, 0.26881111],
        [29, 11, -0.43460903],
        [29, 12, -0.47421896],
        [29, 13, 0.13892758],
        [29, 14, -0.52743834],
        [29, 15, -1.2894465],
        [29, 16, -0.44122109],
        [29, 17, 0.55490535],
        [29, 18, -0.70220029],
        [29, 19, -0.092483141],
        [29, 20, 0.54743236],
        [29, 21, 0.42072135],
        [29, 22, 1.4811441],
        [29, 23, -0.21440035],
        [29, 24, -0.94724602],
        [29, 25, -1.0281734],
        [29, 26, 0.14892021],
        [29, 27, 0.66560769],
        [29, 28, -0.022656918],
        [29, 29, 3.0689335],
        [29, 30, -0.64794737],
        [29, 31, 0.15125105],
        [29, 32, -0.17751405],
        [29, 33, -0.68136448],
        [29, 34, -0.014490684],
        [29, 35, 0.36538702],
        [29, 36, -1.0469508],
        [29, 37, 0.85292459],
        [29, 38, 0.90881819],
        [29, 39, 0.60267067],
        [29, 40, -0.076676816],
        [29, 41, 0.93598098],
        [29, 42, 0.2258722],
        [29, 43, 0.056525938],
        [29, 44, -0.3604179],
        [29, 45, -0.41994295],
        [29, 46, 0.095532484],
        [29, 47, 0.82408947],
        [29, 48, -0.67298657],
        [29, 49, 1.042949],
        [30, 0, 0.36900836],
        [30, 1, -0.05501423],
        [30, 2, 0.87197393],
        [30, 3, 0.46455759],
        [30, 4, 0.54275209],
        [30, 5, 1.1644342],
        [30, 6, 0.026351785],
        [30, 7, 0.65899336],
        [30, 8, 1.9616343],
        [30, 9, 0.31610689],
        [30, 10, 0.48958173],
        [30, 11, -0.12486894],
        [30, 12, -0.22714899],
        [30, 13, 1.0779301],
        [30, 14, 1.2022696],
        [30, 15, -0.30009902],
        [30, 16, 1.7320824],
        [30, 17, 0.94502538],
        [30, 18, 1.4620994],
        [30, 19, 0.78757757],
        [30, 20, 1.4538343],
        [30, 21, 0.09909489],
        [30, 22, 1.4260123],
        [30, 23, 1.0638676],
        [30, 24, 0.052580088],
        [30, 25, 0.21423067],
        [30, 26, 0.71805167],
        [30, 27, -0.26423323],
        [30, 28, 0.54230559],
        [30, 29, 0.052510988],
        [30, 30, 0.76631141],
        [30, 31, 0.24435121],
        [30, 32, 0.51869065],
        [30, 33, 0.79023886],
        [30, 34, 0.34452835],
        [30, 35, 1.1444905],
        [30, 36, 0.99683917],
        [30, 37, 0.59756887],
        [30, 38, 1.4019668],
        [30, 39, 0.83303356],
        [30, 40, -0.17326978],
        [30, 41, 1.0948827],
        [30, 42, 0.46758199],
        [30, 43, 0.093523175],
        [30, 44, -0.032976691],
        [30, 45, 1.0076789],
        [30, 46, 0.85731637],
        [30, 47, 0.77288997],
        [30, 48, -0.037523374],
        [30, 49, 0.68535924],
        [31, 0, -0.13876349],
        [31, 1, -1.1856327],
        [31, 2, 0.1135323],
        [31, 3, -1.1520089],
        [31, 4, 0.51046991],
        [31, 5, 0.38460818],
        [31, 6, 0.77700847],
        [31, 7, 1.0100435],
        [31, 8, -0.34671187],
        [31, 9, -0.69601387],
        [31, 10, 0.29945379],
        [31, 11, -0.4321098],
        [31, 12, -2.0130782],
        [31, 13, -0.38170359],
        [31, 14, 0.26124153],
        [31, 15, -1.1001918],
        [31, 16, -0.30728945],
        [31, 17, 0.57191437],
        [31, 18, 0.29394475],
        [31, 19, 0.11624458],
        [31, 20, 1.0335058],
        [31, 21, -0.1208848],
        [31, 22, 1.0529634],
        [31, 23, 0.41441256],
        [31, 24, -0.013467194],
        [31, 25, -0.056773271],
        [31, 26, 0.33413857],
        [31, 27, 2.787775],
        [31, 28, 0.12644678],
        [31, 29, -0.64520669],
        [31, 30, 0.22346392],
        [31, 31, 1.0667696],
        [31, 32, -0.74114424],
        [31, 33, -0.10502936],
        [31, 34, -0.34297943],
        [31, 35, 0.65356207],
        [31, 36, -0.056306768],
        [31, 37, -1.0323266],
        [31, 38, 0.14527044],
        [31, 39, 0.99092633],
        [31, 40, 0.016664999],
        [31, 41, -0.13369095],
        [31, 42, 0.29323164],
        [31, 43, -0.071809866],
        [31, 44, -0.27918258],
        [31, 45, -0.13910267],
        [31, 46, 0.14214906],
        [31, 47, -0.91522008],
        [31, 48, -1.3554798],
        [31, 49, -0.27081257],
        [32, 0, 1.395239],
        [32, 1, 0.19931202],
        [32, 2, 0.21176666],
        [32, 3, 0.29308513],
        [32, 4, 0.5126093],
        [32, 5, 0.90898132],
        [32, 6, 1.9685857],
        [32, 7, 3.1855898],
        [32, 8, 1.5158616],
        [32, 9, 0.73943841],
        [32, 10, 0.96893859],
        [32, 11, 2.1150346],
        [32, 12, 0.28864032],
        [32, 13, 0.68640482],
        [32, 14, 1.5263433],
        [32, 15, 1.7558149],
        [32, 16, 0.32714847],
        [32, 17, -0.059658714],
        [32, 18, 1.7373016],
        [32, 19, 0.2308805],
        [32, 20, 1.0528091],
        [32, 21, 0.32974607],
        [32, 22, 1.0468136],
        [32, 23, 1.4868853],
        [32, 24, -0.80023319],
        [32, 25, -0.54549599],
        [32, 26, 1.0660533],
        [32, 27, 2.1865296],
        [32, 28, -0.17770383],
        [32, 29, 0.63076466],
        [32, 30, 0.18477641],
        [32, 31, -0.2273348],
        [32, 32, 3.1263497],
        [32, 33, 1.9674394],
        [32, 34, 0.69618899],
        [32, 35, 2.5634143],
        [32, 36, 0.20557593],
        [32, 37, 1.397205],
        [32, 38, 2.2655988],
        [32, 39, 1.0250651],
        [32, 40, 1.6910691],
        [32, 41, -0.23634122],
        [32, 42, 0.90874791],
        [32, 43, 0.41783598],
        [32, 44, 1.7120982],
        [32, 45, 0.77948773],
        [32, 46, 1.0776908],
        [32, 47, 1.4168178],
        [32, 48, 0.54605013],
        [32, 49, 1.6051759],
        [33, 0, 0.080487914],
        [33, 1, 0.13101082],
        [33, 2, -0.024247723],
        [33, 3, -0.16507775],
        [33, 4, 0.12849364],
        [33, 5, 0.85979396],
        [33, 6, 2.8552778],
        [33, 7, 1.2302661],
        [33, 8, 1.5456371],
        [33, 9, 0.058094937],
        [33, 10, 1.0904948],
        [33, 11, 2.3694797],
        [33, 12, -0.28672037],
        [33, 13, 0.48001462],
        [33, 14, 0.99442923],
        [33, 15, -0.15611994],
        [33, 16, 0.27330196],
        [33, 17, 0.53664362],
        [33, 18, 1.1050096],
        [33, 19, -0.67567444],
        [33, 20, 0.79358011],
        [33, 21, 0.22952381],
        [33, 22, 0.51125091],
        [33, 23, 1.0764534],
        [33, 24, -0.77373415],
        [33, 25, -0.83917701],
        [33, 26, -0.10980044],
        [33, 27, 0.84343129],
        [33, 28, -0.6814912],
        [33, 29, -0.52278054],
        [33, 30, -0.17062813],
        [33, 31, 0.32399547],
        [33, 32, -0.28280625],
        [33, 33, 3.2892661],
        [33, 34, 0.08172325],
        [33, 35, 1.3008699],
        [33, 36, 0.27749881],
        [33, 37, 0.97564799],
        [33, 38, 1.6527535],
        [33, 39, 1.9740145],
        [33, 40, 2.6477215],
        [33, 41, -0.41456547],
        [33, 42, 1.2081655],
        [33, 43, 0.44233924],
        [33, 44, 2.1845331],
        [33, 45, 0.34185377],
        [33, 46, -0.7446844],
        [33, 47, 0.4591935],
        [33, 48, 1.2826676],
        [33, 49, 1.7722566],
        [34, 0, -0.95208824],
        [34, 1, -1.1092569],
        [34, 2, -1.2005725],
        [34, 3, -0.055785362],
        [34, 4, 0.01362975],
        [34, 5, -0.45351309],
        [34, 6, -0.42300123],
        [34, 7, -0.30900633],
        [34, 8, -1.1750711],
        [34, 9, -0.68965197],
        [34, 10, 0.2672953],
        [34, 11, 0.41694272],
        [34, 12, -0.77037996],
        [34, 13, -0.78525329],
        [34, 14, -0.99355787],
        [34, 15, -1.3212506],
        [34, 16, -0.65761507],
        [34, 17, -0.30721843],
        [34, 18, 0.10507262],
        [34, 19, -1.1723377],
        [34, 20, 0.0052048806],
        [34, 21, -0.7471453],
        [34, 22, 0.073362179],
        [34, 23, -0.46846342],
        [34, 24, -0.50535148],
        [34, 25, -0.62974852],
        [34, 26, -0.32539499],
        [34, 27, -0.59654069],
        [34, 28, 0.25232181],
        [34, 29, -0.25101411],
        [34, 30, -0.87278885],
        [34, 31, 0.60535306],
        [34, 32, -1.2179755],
        [34, 33, -0.46891853],
        [34, 34, 0.63864779],
        [34, 35, 0.022783421],
        [34, 36, -0.29849043],
        [34, 37, -1.3042686],
        [34, 38, -0.23548211],
        [34, 39, 1.1666503],
        [34, 40, 0.4607186],
        [34, 41, 0.5088895],
        [34, 42, 0.093830496],
        [34, 43, 0.11501288],
        [34, 44, 0.84561735],
        [34, 45, -0.517124],
        [34, 46, -0.023548841],
        [34, 47, -1.186949],
        [34, 48, -1.7675412],
        [34, 49, -0.7943964],
        [35, 0, -0.2227627],
        [35, 1, 0.61171067],
        [35, 2, -0.13361277],
        [35, 3, -1.0789537],
        [35, 4, -0.45404068],
        [35, 5, 0.4591724],
        [35, 6, 1.4766047],
        [35, 7, 0.16658394],
        [35, 8, 0.78581905],
        [35, 9, 1.64947],
        [35, 10, 1.8118178],
        [35, 11, 1.1223863],
        [35, 12, 0.20905961],
        [35, 13, 0.74108452],
        [35, 14, 0.8613705],
        [35, 15, -1.0827031],
        [35, 16, -0.030299123],
        [35, 17, 0.23779887],
        [35, 18, 1.7150307],
        [35, 19, -1.6101371],
        [35, 20, -0.047179654],
        [35, 21, -1.5083317],
        [35, 22, 0.89064211],
        [35, 23, 0.1669278],
        [35, 24, -0.35257915],
        [35, 25, -0.47711191],
        [35, 26, 1.7710098],
        [35, 27, 0.49791616],
        [35, 28, 0.76093864],
        [35, 29, -0.18695883],
        [35, 30, 1.0428423],
        [35, 31, 1.001163],
        [35, 32, -1.0574902],
        [35, 33, 1.1694124],
        [35, 34, -0.27905068],
        [35, 35, 3.8849566],
        [35, 36, -0.63979107],
        [35, 37, 0.27443078],
        [35, 38, 0.070821948],
        [35, 39, 2.8256514],
        [35, 40, 0.80684161],
        [35, 41, 0.42152172],
        [35, 42, 0.5235101],
        [35, 43, -1.0005082],
        [35, 44, 0.31578755],
        [35, 45, -0.058830678],
        [35, 46, 1.5159388],
        [35, 47, 0.30577531],
        [35, 48, 0.17456961],
        [35, 49, 0.34625185],
        [36, 0, 1.3429388],
        [36, 1, -0.63042706],
        [36, 2, 0.12665632],
        [36, 3, -0.58782804],
        [36, 4, 0.98803902],
        [36, 5, 0.73203266],
        [36, 6, -0.349024],
        [36, 7, 0.4788706],
        [36, 8, 1.0188354],
        [36, 9, -0.57751888],
        [36, 10, 1.0780028],
        [36, 11, 0.59195381],
        [36, 12, 0.40390685],
        [36, 13, 0.32033053],
        [36, 14, 0.25684801],
        [36, 15, -0.82466906],
        [36, 16, 0.79079092],
        [36, 17, 0.78973049],
        [36, 18, 0.94490409],
        [36, 19, -0.049319625],
        [36, 20, 0.51096821],
        [36, 21, 0.64112872],
        [36, 22, 0.28631458],
        [36, 23, 0.71243584],
        [36, 24, -0.12375505],
        [36, 25, 0.10359748],
        [36, 26, 0.27849084],
        [36, 27, 0.47133872],
        [36, 28, -0.89566946],
        [36, 29, -1.1206661],
        [36, 30, 0.12573408],
        [36, 31, -0.019299328],
        [36, 32, -0.6188395],
        [36, 33, 0.45579803],
        [36, 34, -0.258095],
        [36, 35, 0.25808334],
        [36, 36, 1.8243616],
        [36, 37, -0.65992194],
        [36, 38, 0.78871042],
        [36, 39, 1.5768136],
        [36, 40, 0.15793781],
        [36, 41, 0.85393667],
        [36, 42, 1.0343399],
        [36, 43, 0.85202712],
        [36, 44, 0.14269817],
        [36, 45, 0.085786685],
        [36, 46, 0.46144518],
        [36, 47, -0.20485346],
        [36, 48, -0.11865858],
        [36, 49, 0.13738164],
        [37, 0, 0.16312246],
        [37, 1, -0.49803978],
        [37, 2, -0.81967068],
        [37, 3, -2.6907494],
        [37, 4, 0.40959385],
        [37, 5, -0.48958853],
        [37, 6, 1.2402872],
        [37, 7, -0.33624917],
        [37, 8, -0.50184041],
        [37, 9, -0.52370852],
        [37, 10, 0.51115346],
        [37, 11, 0.40129665],
        [37, 12, -0.37117863],
        [37, 13, 0.93107122],
        [37, 14, 0.14615141],
        [37, 15, -1.3574064],
        [37, 16, -0.57069069],
        [37, 17, -0.18256669],
        [37, 18, 0.94525111],
        [37, 19, -3.3918793],
        [37, 20, -0.40501559],
        [37, 21, -0.65449619],
        [37, 22, 0.31130815],
        [37, 23, -1.5419819],
        [37, 24, -0.45487601],
        [37, 25, -0.8589195],
        [37, 26, 0.61551565],
        [37, 27, 0.57904422],
        [37, 28, 1.4136636],
        [37, 29, 0.87251514],
        [37, 30, 0.08644554],
        [37, 31, 0.37943789],
        [37, 32, -1.8772076],
        [37, 33, 0.33754304],
        [37, 34, 0.22265446],
        [37, 35, 0.049961925],
        [37, 36, -0.68299443],
        [37, 37, 2.4517639],
        [37, 38, -0.12535223],
        [37, 39, 1.6062883],
        [37, 40, 0.34498423],
        [37, 41, 0.23119196],
        [37, 42, -0.27759102],
        [37, 43, -0.22426812],
        [37, 44, 0.68377471],
        [37, 45, -0.19468714],
        [37, 46, -0.58931571],
        [37, 47, 0.79111272],
        [37, 48, 0.33538514],
        [37, 49, -0.241116],
        [38, 0, -0.60464394],
        [38, 1, -0.13992234],
        [38, 2, 0.73907632],
        [38, 3, 0.89129561],
        [38, 4, -0.48141918],
        [38, 5, 0.67366481],
        [38, 6, -0.56799525],
        [38, 7, 2.0874426],
        [38, 8, 0.85874033],
        [38, 9, -0.10198858],
        [38, 10, 0.10322352],
        [38, 11, 1.6993002],
        [38, 12, -0.77775013],
        [38, 13, 0.47658113],
        [38, 14, 0.67485434],
        [38, 15, 1.5545752],
        [38, 16, -0.29602614],
        [38, 17, 0.36582762],
        [38, 18, -0.41034412],
        [38, 19, -0.570979],
        [38, 20, -0.64275879],
        [38, 21, 0.10713812],
        [38, 22, -0.26366535],
        [38, 23, 1.042787],
        [38, 24, 0.64737183],
        [38, 25, 0.39127564],
        [38, 26, 1.6483172],
        [38, 27, -1.3419497],
        [38, 28, -0.44131023],
        [38, 29, 0.2111953],
        [38, 30, -0.054320913],
        [38, 31, -0.31760651],
        [38, 32, 0.12518932],
        [38, 33, 0.98835254],
        [38, 34, 0.025482878],
        [38, 35, 1.4782815],
        [38, 36, 0.051153976],
        [38, 37, 0.40492603],
        [38, 38, 2.6808972],
        [38, 39, 1.4297],
        [38, 40, 0.81717491],
        [38, 41, -0.18158248],
        [38, 42, 1.1399114],
        [38, 43, 0.93557483],
        [38, 44, 1.9473431],
        [38, 45, 0.65618676],
        [38, 46, 1.5861324],
        [38, 47, 0.29142883],
        [38, 48, 1.623965],
        [38, 49, -0.17883646],
        [39, 0, 1.1970185],
        [39, 1, -0.44012162],
        [39, 2, 0.5314731],
        [39, 3, -1.0491152],
        [39, 4, 1.0657871],
        [39, 5, 0.47001457],
        [39, 6, 0.61318064],
        [39, 7, 0.71182477],
        [39, 8, -1.2036564],
        [39, 9, -0.48063377],
        [39, 10, 0.26145461],
        [39, 11, -0.46947637],
        [39, 12, -0.26117012],
        [39, 13, 0.66986066],
        [39, 14, -0.35737854],
        [39, 15, -0.73369753],
        [39, 16, 0.031625975],
        [39, 17, 0.38015577],
        [39, 18, -0.34773892],
        [39, 19, -0.71846217],
        [39, 20, 0.84966999],
        [39, 21, 0.039582435],
        [39, 22, 0.62852228],
        [39, 23, -0.3889325],
        [39, 24, 0.23176816],
        [39, 25, 0.051802907],
        [39, 26, 0.53638369],
        [39, 27, 0.63714349],
        [39, 28, -0.34342963],
        [39, 29, 0.33895129],
        [39, 30, -0.003087454],
        [39, 31, 1.2543821],
        [39, 32, 0.098002762],
        [39, 33, -0.25631705],
        [39, 34, -0.74101257],
        [39, 35, 0.90996993],
        [39, 36, 0.13642311],
        [39, 37, 0.74937308],
        [39, 38, 0.63980848],
        [39, 39, 2.2737484],
        [39, 40, -0.56485629],
        [39, 41, 0.73720592],
        [39, 42, 0.23748355],
        [39, 43, 1.0579667],
        [39, 44, -0.74882996],
        [39, 45, 0.0128235],
        [39, 46, 1.2348744],
        [39, 47, 1.0018165],
        [39, 48, -0.2092565],
        [39, 49, -0.035867997],
        [40, 0, 0.98440486],
        [40, 1, 0.34941861],
        [40, 2, -0.22267105],
        [40, 3, -0.76989138],
        [40, 4, 0.96378905],
        [40, 5, -0.56499875],
        [40, 6, 0.63345951],
        [40, 7, -1.2526126],
        [40, 8, 1.3007278],
        [40, 9, 0.099791862],
        [40, 10, 0.7505303],
        [40, 11, -0.06971889],
        [40, 12, 0.38510635],
        [40, 13, -0.16339806],
        [40, 14, 0.058290008],
        [40, 15, -0.63837332],
        [40, 16, -0.14242265],
        [40, 17, -0.75346112],
        [40, 18, 0.35090119],
        [40, 19, -0.24337687],
        [40, 20, -0.051510707],
        [40, 21, 0.13738281],
        [40, 22, -0.26676196],
        [40, 23, -0.37941542],
        [40, 24, -0.18426178],
        [40, 25, -0.040926121],
        [40, 26, -0.094731472],
        [40, 27, -0.3932395],
        [40, 28, -0.86917138],
        [40, 29, 2.2280664],
        [40, 30, 0.22941437],
        [40, 31, 0.57172054],
        [40, 32, -0.5879727],
        [40, 33, -0.14007717],
        [40, 34, -0.65809762],
        [40, 35, 0.11442404],
        [40, 36, -0.065320179],
        [40, 37, -1.00749],
        [40, 38, 0.60874242],
        [40, 39, 0.91023368],
        [40, 40, 0.44996071],
        [40, 41, 0.76687497],
        [40, 42, -0.73083013],
        [40, 43, 0.43428379],
        [40, 44, -0.21646328],
        [40, 45, -0.61608976],
        [40, 46, 1.0945992],
        [40, 47, -1.1816502],
        [40, 48, 0.25257221],
        [40, 49, 0.85800713],
        [41, 0, -0.15370031],
        [41, 1, 0.29420251],
        [41, 2, -0.10969708],
        [41, 3, 1.5986909],
        [41, 4, 0.33408073],
        [41, 5, 0.22521734],
        [41, 6, -0.24634463],
        [41, 7, 0.079310037],
        [41, 8, 0.28633094],
        [41, 9, 0.72246099],
        [41, 10, 0.21473791],
        [41, 11, -0.5964092],
        [41, 12, 0.70513743],
        [41, 13, 0.12750751],
        [41, 14, -0.50103825],
        [41, 15, -0.70104021],
        [41, 16, -0.04037948],
        [41, 17, 0.10253682],
        [41, 18, 0.74985516],
        [41, 19, 0.34952065],
        [41, 20, 0.98465329],
        [41, 21, -0.40880424],
        [41, 22, 1.8367454],
        [41, 23, -0.41625923],
        [41, 24, 2.0724967],
        [41, 25, 1.8971361],
        [41, 26, 0.19797601],
        [41, 27, 0.75503951],
        [41, 28, 0.61917168],
        [41, 29, 1.6626205],
        [41, 30, -0.9992069],
        [41, 31, -0.82515144],
        [41, 32, 1.4152315],
        [41, 33, 0.2548551],
        [41, 34, 1.0254812],
        [41, 35, 0.45598969],
        [41, 36, -0.22051537],
        [41, 37, 0.3820298],
        [41, 38, 0.20794562],
        [41, 39, -0.047047727],
        [41, 40, -0.33974978],
        [41, 41, 2.5176034],
        [41, 42, 0.76353079],
        [41, 43, 0.31371939],
        [41, 44, -0.52986884],
        [41, 45, -0.055376559],
        [41, 46, 0.229729],
        [41, 47, 0.4589172],
        [41, 48, 0.61246198],
        [41, 49, 0.71379453],
        [42, 0, -0.6797998],
        [42, 1, -0.90026879],
        [42, 2, -1.4366788],
        [42, 3, -0.62746638],
        [42, 4, 1.4741399],
        [42, 5, -0.52517509],
        [42, 6, -0.39305097],
        [42, 7, -0.78153545],
        [42, 8, -0.8881132],
        [42, 9, -0.061538219],
        [42, 10, 1.2642831],
        [42, 11, -0.68268192],
        [42, 12, -0.20546415],
        [42, 13, 0.91785967],
        [42, 14, 0.072947107],
        [42, 15, -0.14519559],
        [42, 16, -0.026990144],
        [42, 17, -0.19726108],
        [42, 18, 0.81878346],
        [42, 19, -0.1517203],
        [42, 20, 1.1349182],
        [42, 21, -2.1324418],
        [42, 22, 1.102453],
        [42, 23, 0.027095487],
        [42, 24, 0.22981352],
        [42, 25, -0.025995944],
        [42, 26, 0.48921734],
        [42, 27, -0.21496686],
        [42, 28, -0.36853901],
        [42, 29, 0.57228452],
        [42, 30, 1.2085146],
        [42, 31, 0.0718178],
        [42, 32, 1.2483612],
        [42, 33, -0.4579843],
        [42, 34, -0.65235263],
        [42, 35, 0.91545153],
        [42, 36, 0.73593432],
        [42, 37, -1.51667],
        [42, 38, -0.22883435],
        [42, 39, 0.056269828],
        [42, 40, -1.2300727],
        [42, 41, 0.49883562],
        [42, 42, 1.883911],
        [42, 43, -1.7077432],
        [42, 44, -0.68264937],
        [42, 45, -0.20557415],
        [42, 46, 0.15200259],
        [42, 47, -1.483592],
        [42, 48, -1.3624301],
        [42, 49, 0.34602591],
        [43, 0, 0.13967998],
        [43, 1, -0.21483243],
        [43, 2, 0.16775036],
        [43, 3, 1.3106143],
        [43, 4, -0.71966952],
        [43, 5, -0.43095553],
        [43, 6, -1.4311112],
        [43, 7, 0.41010123],
        [43, 8, 0.28047699],
        [43, 9, -0.39575931],
        [43, 10, -0.26336697],
        [43, 11, -0.1049523],
        [43, 12, 0.41685304],
        [43, 13, -0.35609707],
        [43, 14, -2.4311993],
        [43, 15, -0.40532872],
        [43, 16, -0.85755062],
        [43, 17, -0.060675286],
        [43, 18, 0.14045185],
        [43, 19, 0.51119041],
        [43, 20, -0.044302817],
        [43, 21, -0.44590607],
        [43, 22, 0.43403503],
        [43, 23, 0.52263814],
        [43, 24, 1.1440145],
        [43, 25, 0.33072305],
        [43, 26, 0.5574283],
        [43, 27, 0.45694837],
        [43, 28, -0.19200236],
        [43, 29, 0.059440892],
        [43, 30, -1.6332188],
        [43, 31, 0.054755755],
        [43, 32, -1.0528105],
        [43, 33, -0.16199192],
        [43, 34, -0.86494964],
        [43, 35, 0.14078362],
        [43, 36, -0.94544369],
        [43, 37, 0.028839486],
        [43, 38, 0.66405541],
        [43, 39, -0.59414518],
        [43, 40, -0.36737961],
        [43, 41, 0.55777079],
        [43, 42, 1.8286885],
        [43, 43, -0.027979944],
        [43, 44, 0.053700864],
        [43, 45, -0.20260017],
        [43, 46, -0.07529673],
        [43, 47, 0.064943947],
        [43, 48, -1.0504441],
        [43, 49, 0.96106374],
        [44, 0, -0.60252619],
        [44, 1, 0.77147889],
        [44, 2, -1.3585659],
        [44, 3, -1.2007045],
        [44, 4, 0.94525099],
        [44, 5, -0.63742626],
        [44, 6, 0.030694358],
        [44, 7, -1.0073131],
        [44, 8, 1.4336669],
        [44, 9, 0.94815958],
        [44, 10, 1.6088092],
        [44, 11, 0.4989523],
        [44, 12, -0.32570869],
        [44, 13, -0.47508144],
        [44, 14, -1.3253874],
        [44, 15, -0.69543457],
        [44, 16, -0.73509151],
        [44, 17, -0.87549764],
        [44, 18, -0.25299546],
        [44, 19, -0.627671],
        [44, 20, -0.73241758],
        [44, 21, 0.37535936],
        [44, 22, -0.10358014],
        [44, 23, 0.18156022],
        [44, 24, -0.43015566],
        [44, 25, -0.59454781],
        [44, 26, -0.45957741],
        [44, 27, 1.0345823],
        [44, 28, -1.9517055],
        [44, 29, 0.84974438],
        [44, 30, -1.6824081],
        [44, 31, 0.40680459],
        [44, 32, -1.2267236],
        [44, 33, -0.51300675],
        [44, 34, -1.5895288],
        [44, 35, 0.34280732],
        [44, 36, -0.2602742],
        [44, 37, -0.171067],
        [44, 38, 0.37620929],
        [44, 39, 2.1158886],
        [44, 40, 0.23656064],
        [44, 41, -0.16477661],
        [44, 42, 0.55100793],
        [44, 43, 0.086005792],
        [44, 44, 1.4191613],
        [44, 45, -1.2692983],
        [44, 46, 1.4803357],
        [44, 47, -0.68209732],
        [44, 48, -1.3348371],
        [44, 49, -0.27316427],
        [45, 0, 0.83346045],
        [45, 1, -0.70934224],
        [45, 2, 0.25212434],
        [45, 3, -0.74444604],
        [45, 4, 0.16818681],
        [45, 5, 0.94019288],
        [45, 6, 1.0429991],
        [45, 7, 0.68417513],
        [45, 8, -0.018804142],
        [45, 9, -0.6612972],
        [45, 10, 0.91175765],
        [45, 11, -0.92617953],
        [45, 12, 0.33454135],
        [45, 13, 0.92571962],
        [45, 14, 0.48800859],
        [45, 15, 0.18800549],
        [45, 16, 0.1750254],
        [45, 17, 1.1239855],
        [45, 18, -0.11234774],
        [45, 19, -0.32967964],
        [45, 20, 0.22677638],
        [45, 21, -0.8499195],
        [45, 22, 0.30350289],
        [45, 23, -0.063242897],
        [45, 24, -0.50889534],
        [45, 25, -0.40273112],
        [45, 26, -0.024196893],
        [45, 27, -1.5024873],
        [45, 28, -0.46601114],
        [45, 29, -0.90399742],
        [45, 30, 0.54429311],
        [45, 31, -0.23975502],
        [45, 32, 0.0049380166],
        [45, 33, -0.16139255],
        [45, 34, 1.1232488],
        [45, 35, -0.51619327],
        [45, 36, 0.11963619],
        [45, 37, 0.64657927],
        [45, 38, 0.34365693],
        [45, 39, 1.7183939],
        [45, 40, -0.79396749],
        [45, 41, 0.63303244],
        [45, 42, -0.1264825],
        [45, 43, -0.58008945],
        [45, 44, -1.5916232],
        [45, 45, 3.4776895],
        [45, 46, 0.48154786],
        [45, 47, 0.83385396],
        [45, 48, -1.0633991],
        [45, 49, 1.2890936],
        [46, 0, 0.47145614],
        [46, 1, -0.056328446],
        [46, 2, 1.7419623],
        [46, 3, -1.4314852],
        [46, 4, 0.17542247],
        [46, 5, 0.015917698],
        [46, 6, 1.0874088],
        [46, 7, 0.99318284],
        [46, 8, 0.51312476],
        [46, 9, -0.11582596],
        [46, 10, -0.24404763],
        [46, 11, 0.38714516],
        [46, 12, 0.61488676],
        [46, 13, 1.0669217],
        [46, 14, 0.47937754],
        [46, 15, 0.80791175],
        [46, 16, -0.51628983],
        [46, 17, -0.31835443],
        [46, 18, -0.20288202],
        [46, 19, -1.4098891],
        [46, 20, 0.60649472],
        [46, 21, -0.011881109],
        [46, 22, 0.65625918],
        [46, 23, 0.43764862],
        [46, 24, -0.52699035],
        [46, 25, -0.90861988],
        [46, 26, -0.24537468],
        [46, 27, 1.8973917],
        [46, 28, -0.62321645],
        [46, 29, -0.27904373],
        [46, 30, -0.71183574],
        [46, 31, -0.10003374],
        [46, 32, -0.94551826],
        [46, 33, -0.30656108],
        [46, 34, 0.037124094],
        [46, 35, 0.12712143],
        [46, 36, -0.46056095],
        [46, 37, 0.025753317],
        [46, 38, 2.6340363],
        [46, 39, 0.6549601],
        [46, 40, 0.21001728],
        [46, 41, 0.091202565],
        [46, 42, 0.090030253],
        [46, 43, 0.12256327],
        [46, 44, -0.75459915],
        [46, 45, 0.27680588],
        [46, 46, 3.1643441],
        [46, 47, -0.20777348],
        [46, 48, 1.2400036],
        [46, 49, -0.64906788],
        [47, 0, 2.4896204],
        [47, 1, -0.052720342],
        [47, 2, 0.75939626],
        [47, 3, -0.47498801],
        [47, 4, 1.6580963],
        [47, 5, 1.1510583],
        [47, 6, 1.5311534],
        [47, 7, 0.059480287],
        [47, 8, 0.70449877],
        [47, 9, 0.13775572],
        [47, 10, 2.4470091],
        [47, 11, 0.73323089],
        [47, 12, 1.3993564],
        [47, 13, 1.3883287],
        [47, 14, -0.016327929],
        [47, 15, 1.1814283],
        [47, 16, 0.69886547],
        [47, 17, 1.188013],
        [47, 18, 1.0251826],
        [47, 19, 1.0143614],
        [47, 20, 1.9960469],
        [47, 21, 1.229905],
        [47, 22, 2.1339986],
        [47, 23, 0.25790018],
        [47, 24, 0.48199448],
        [47, 25, 0.3828125],
        [47, 26, 0.35740229],
        [47, 27, 1.6386883],
        [47, 28, 1.8227404],
        [47, 29, 0.65779567],
        [47, 30, 0.53775805],
        [47, 31, 1.4437305],
        [47, 32, 0.60443676],
        [47, 33, 0.017681997],
        [47, 34, 1.0043076],
        [47, 35, -0.1368147],
        [47, 36, 1.5529023],
        [47, 37, -0.70624226],
        [47, 38, 0.95489538],
        [47, 39, 3.148401],
        [47, 40, 0.25701883],
        [47, 41, 0.79198807],
        [47, 42, 0.90478349],
        [47, 43, 1.780885],
        [47, 44, 0.19636309],
        [47, 45, 1.0873804],
        [47, 46, 1.030557],
        [47, 47, 0.95766336],
        [47, 48, -0.47139925],
        [47, 49, 0.5816074],
        [48, 0, 0.52384967],
        [48, 1, 0.65272886],
        [48, 2, 0.74774373],
        [48, 3, 1.049912],
        [48, 4, 0.90241992],
        [48, 5, -0.026890388],
        [48, 6, 1.0418606],
        [48, 7, 1.8464381],
        [48, 8, -1.0964383],
        [48, 9, 0.11381776],
        [48, 10, -0.23650549],
        [48, 11, 0.43775263],
        [48, 12, 2.0090725],
        [48, 13, 1.2781916],
        [48, 14, -2.138541],
        [48, 15, 0.49019364],
        [48, 16, -0.16909266],
        [48, 17, 0.61339438],
        [48, 18, 1.3265395],
        [48, 19, -0.73976672],
        [48, 20, -0.11054882],
        [48, 21, -0.12577276],
        [48, 22, 0.099016592],
        [48, 23, 1.0129231],
        [48, 24, 1.4303041],
        [48, 25, 1.3031784],
        [48, 26, 0.63309503],
        [48, 27, 1.9459724],
        [48, 28, -0.011884523],
        [48, 29, 1.4866365],
        [48, 30, -0.3079837],
        [48, 31, -0.77796942],
        [48, 32, 0.73967355],
        [48, 33, -1.0628839],
        [48, 34, 1.1251386],
        [48, 35, 0.36761713],
        [48, 36, 0.19451401],
        [48, 37, 1.5658382],
        [48, 38, 1.3253108],
        [48, 39, 0.73058623],
        [48, 40, 0.29688406],
        [48, 41, 0.62774956],
        [48, 42, 0.91229886],
        [48, 43, 0.085373446],
        [48, 44, -0.15495542],
        [48, 45, 0.38829309],
        [48, 46, 0.21493664],
        [48, 47, 1.4752902],
        [48, 48, 0.26876572],
        [48, 49, 0.51903909],
        [49, 0, 0.72913378],
        [49, 1, -0.8732937],
        [49, 2, -0.81435615],
        [49, 3, 0.19217046],
        [49, 4, -0.57881415],
        [49, 5, -0.0094435951],
        [49, 6, 1.4305061],
        [49, 7, -0.0051471959],
        [49, 8, -0.28648013],
        [49, 9, -0.71882278],
        [49, 10, -0.48354736],
        [49, 11, -0.44588628],
        [49, 12, 0.84711951],
        [49, 13, -0.48882431],
        [49, 14, 0.32939366],
        [49, 15, -0.044168402],
        [49, 16, -0.43581277],
        [49, 17, -0.51732999],
        [49, 18, -0.40200895],
        [49, 19, -0.37582064],
        [49, 20, 1.6586932],
        [49, 21, -0.86172587],
        [49, 22, 1.310915],
        [49, 23, 1.2171347],
        [49, 24, 0.17125644],
        [49, 25, 0.022213627],
        [49, 26, 0.57990801],
        [49, 27, 0.32799822],
        [49, 28, 0.52522308],
        [49, 29, -0.67064506],
        [49, 30, 0.18414378],
        [49, 31, 0.23028645],
        [49, 32, -0.66193557],
        [49, 33, 0.49174258],
        [49, 34, 0.57625824],
        [49, 35, 0.72291005],
        [49, 36, -0.65260804],
        [49, 37, -0.039891377],
        [49, 38, 0.028911879],
        [49, 39, -0.076308489],
        [49, 40, 0.033267587],
        [49, 41, 1.1086067],
        [49, 42, -1.3557987],
        [49, 43, -0.53477389],
        [49, 44, -0.76957393],
        [49, 45, 0.12917012],
        [49, 46, 0.74984676],
        [49, 47, 0.0029635045],
        [49, 48, 0.36802319],
        [49, 49, 2.2198679],
      ],
      value6: "0.7",
      value7: "0.7",
      // data2: [[1, 2]],
    };
  },
  computed: {
    ...mapGetters({
      username: "user/username",
      permissions: "user/permissions",
    }),
  },
  mounted() {
    // this.myEcharts();
    this.$nextTick(function () {
      this.myEcharts();
    });
  },
  created() {
    const _this = this;
    console.log(_this.value2[0]);
    // if (sessionStorage.getItem("select")) {
    //   this.Value1 = sessionStorage.getItem("select");
    //   this.value6 = sessionStorage.getItem("select");
    //   this.value7 = sessionStorage.getItem("select");
    // }
    axios.get("http://202.121.180.70:8109/getData?n=10").then(function (resp) {
      console.log(resp);
      _this.user_data_content = resp.data.TrackingOneList;
    });
  },
  methods: {
    chickvalue() {
      // sessionStorage.setItem("select", this.Value1);
      // sessionStorage.setItem("select", this.value6);
      // sessionStorage.setItem("select", this.value7);
      this.$set(this.show1, "香港事件数据集-微博", true);
      // this.$set(this.show1, "李文亮事件数据集-微博", false);
      this.Value2 = this.Value1;
      // this.$set(this.isShow1, false);
      // this.$set(this.isShow2, false);
      // this.$set(this.isShow3, false);
      this.isShow1 = false;
      this.isShow2 = false;
      this.isShow3 = false;
    },
    generatenetwork() {
      this.value3 = this.value1;
      this.value4 = this.value2;
      this.isShow = true;
    },
    generatenetwork1() {
      this.isShow1 = !this.isShow1;
      this.isShow2 = !this.isShow2;
      this.isShow3 = !this.isShow3;
      this.value6 = this.value1;
      this.value7 = this.value2;
      this.Value2 = this.Value1;
    },
    myEcharts() {
      // 基于准备好的dom，初始化echarts实例
      // var myChart = this.$echarts.init(this.$refs.main);
      var myChart = this.$echarts.init(document.getElementById("main"));
      // 指定图表的配置项和数据
      var option = {
        tooltip: {
          position: "top",
        },
        animation: false,
        grid: {
          height: "85%",
          top: "5%",
        },
        xAxis: {
          type: "category",
          name: "source network节点",
          nameGap: 30,
          nameLocation: "middle",
          nameTextStyle: {
            fontSize: 16,
          },
          data: this.hours,
          splitArea: {
            show: true,
          },
          axisLabel: {
            interval: 4, //代表显示所有x轴标签显示
          },
        },
        yAxis: {
          type: "category",
          name: "target network节点",
          nameGap: 60,
          nameLocation: "middle",
          nameTextStyle: {
            fontSize: 16,
          },
          data: this.days,
          splitArea: {
            show: true,
          },
          axisLabel: {
            interval: 4, //代表显示所有x轴标签显示
          },
        },
        visualMap: {
          min: -4,
          max: 4,
          inRange: {
            color: [
              "#FFFFFF",
              "#F8F8FF",
              "#F0FFFF",
              "#ADD8E6",
              "#B0E0E6",
              "#87CEFA",
              "#87CEEB",
              "#00BFFF",
              "#0000FF",
              "#0000CD",
              "#00008B",
            ],
          },
          calculable: true,
          // orient: "vertical",
          orient: "horizontal",
          left: "35%",
          bottom: "93%",
        },
        series: [
          {
            name: "similarity",
            type: "heatmap",
            data: this.data1,
            label: {
              show: false,
            },
            emphasis: {
              itemStyle: {
                shadowBlur: 5,
                shadowColor: "rgba(0, 0, 0, 0.5)",
              },
            },
          },
        ],
      };
      console.log(option);
      // 使用刚指定的配置项和数据显示图表。
      myChart.setOption(option);
    },
  },
};
</script>
<style lang="scss" scoped>
.permissions-container {
  .lodash-content {
    .avatar {
      width: 60px;
      height: 60px;
      border-radius: 50%;
    }
  }
  .Echarts {
    margin-left: 32%;
    margin-top: 2%;
    margin-bottom: 2%;
    height: 120%;
    width: 120%;
  }
  .Echarts1 {
    margin-left: 28%;
    margin-top: 2%;
    margin-bottom: 2%;
    height: 120%;
    width: 120%;
  }
  .Echarts2 {
    margin-left: 12%;
    margin-top: 2%;
    margin-bottom: 2%;
    height: 120%;
    width: 120%;
  }
  .represent {
    line-height: 1.5em;
  }
  .represent1 {
    line-height: 2em;
  }

  .user-report {
    height: 100px;
    overflow-y: auto;
  }
  .border1 {
    border: 0px solid rgb(255, 255, 255);
    margin-left: 30%;
    margin-top: 2%;
    margin-bottom: 2%;
    font-size: 16px;
  }
  .border2 {
    border: 0px solid rgb(255, 255, 255);
    margin-left: 30%;
    margin-top: 2%;
    margin-bottom: 2%;
    font-size: 16px;
  }

  .border {
    border: 1px solid lightgrey;
    border-right-width: 0;
    border-bottom-width: 0;
  }

  .title {
    width: 50px;
    height: 70px;
    text-align: center;
  }

  @media (min-width: 600px) {
    .title {
      width: 150px;
      height: 40px;
    }
  }

  .br {
    border-right: 1px solid lightgrey;
    border-bottom: 1px solid lightgrey;
  }
}
</style>
