<template>
  <div class="strategy" style="padding: 30px">
    <el-table
      :data="tableData"
      :span-method="objectSpanMethod"
      border
      style="width: 100%; margin-top: 20px"
    >
      <el-table-column
        prop="max"
        label="心理干预"
        width="150"
      ></el-table-column>
      <el-table-column
        prop="center"
        label="干预策略"
        width="180"
      ></el-table-column>
      <el-table-column prop="min" label="策略介绍"></el-table-column>
      <el-table-column prop="minni" label="策略应用"></el-table-column>
    </el-table>
  </div>
</template>

<script>
// import showcontentvue from './showcontent.vue'
import Axios from "axios";
export default {
  data() {
    return {
      tableData: [
        {
          max: "心理劝导策略",
          center: "信息源调整策略",
          min:
            "通过改变信息源在信息支持者心中的权威性，从而降低其对偏差国家公共安全信息的信任程度，增加其对官方可靠信息的信任度。",
          minni:
            "例如：通过权威部门直接发声，对某些不实信息进行详尽驳斥，以从根本上转变信息支持者的观念和态度。",
        },
        {
          max: "心理劝导策略",
          center: "内容辩驳策略",
          min:
            "通过指出偏差信息的矛盾之处，使得偏差信息支持者认识到偏差信息的不合理性。",
          minni:
            "例如：帮助偏差信息支持者利用清楚的信息首先识别自动思维，发现和识别自动化的思维过程。咨询师可以采用提问、自我演示或模仿等方法，找出导致某种反应的网络信息。然后识别认知错误（即来访者在概念和抽象上常犯的错误），需帮助偏差信息支持者归纳出它们的一般规律。",
        },
        {
          max: "心理劝导策略",
          center: "信息框架策略",
          min: "针对不同个体，采用不同的信息描述框架进行劝导。",
          minni:
            "例如：在呈现信息时，对于女性，可以采取利用更多能够勾起同理心、情绪反应的配图等方式，而对于男性则需要更加直线的逻辑论述。",
        },
        {
          max: "心理劝导策略",
          center: "权威亲近策略",
          min:
            "减少权威信息发布者和偏差信息支持者之间的距离感，使信息接受者感到亲近，从而转移其支持对象。",
          minni:
            "避免过于官方和有距离感的措辞，在保证权威和准确的前提下尽量保持亲近。例如媒体平台或发言人可以利用同理心揣摩信息受众心理。",
        },
        {
          max: "心理劝导策略",
          center: "公开承诺策略",
          min: "要求信息支持者对于其所在立场和态度进行公开承诺。",
          minni:
            "若相关部门、机构、新媒体这时要求偏差信息支持者进行公开承诺，则能够让信息支持者意识到其所站立场的重要性，从而重新思考其态度与立场是否正确。若能在同时再对信息支持者进行说服，并且使其对权威信息的支持进行公开承诺，则其态度很难再次倒向偏差信息一边。",
        },
        {
          max: "心理助推策略",
          center: "信息锚定策略",
          min: "及时发布具有专业性和准确性的权威信息，抢占信息高地。",
          minni:
            "例如：利用主流媒体认清传播规律并及时介入，以正面框架进行引导，就能跳出自媒体负性框架的“怪圈”。",
        },
        {
          max: "心理助推策略",
          center: "观点引导策略",
          min:
            "采取先引导网络意见领袖，再以意见领袖引导其身后群体的方式引导其信息传播者的观点。",
          minni:
            "例如：一方面是引导既有的网络意见领袖。许多网络意见领袖与网民身份接近，更容易交流意见，有独特的优势和长处。对他们的积极建言，应当鼓励。有关方面要加强与网络意见领袖的沟通，引导他们成为网络环境中的建设力量而非破坏力量。另一方面更可以主动培养网络意见领袖以引导网络的主流舆论。精心打造、培养一批主流新闻网站的优秀强势论坛，让主流、权威、真实、可靠的声音占领公众意见市场。",
        },
        {
          max: "心理助推策略",
          center: "情境明确策略",
          min:
            "帮助信息传播者在其传播信息之前明确情境，以助推信息传播者在客观衡量之后做出选择。",
          minni:
            "例如：在某新闻发布端评论板块设置赞成、反对以及中立板块，防止由于大量某种偏向信息导致个体以偏概全。当个体能够看到多种态度的存在，就会更多考虑情境本身的正确与否，从而降低盲目从众的可能性，避免大规模群里集结造成的行为感染。",
        },
        {
          max: "心理助推策略",
          center: "信息网络策略",
          min:
            "构建多种渠道的信息网络，使得偏差信息传播者处于多种信息的影响中。",
          minni:
            "例如：在网络媒介本身的选择方面，要注意避免受单一媒体平台的影响。网络信息传播本身具有宽而浅的特点，自媒体中的意见领袖从某种程度上降低了信息传播的真实性与权威性。因而加工者在解读时要尝试思考平台本身所具有的特点，尝试采取批判性思维方式，在认知过程中衡量信息传播者本身的特点，在此基础上评价信息。",
        },
        {
          max: "心理助推策略",
          center: "环境引导策略",
          min: "构建相互支持的信息环境，使得个体在给定的信息环境中活动。",
          minni:
            "例如：通过新闻媒体进行大量正面的客观报道和宣传，增加人们对受偏见群体的全面认识。通过新闻媒体对某个群体或个人的正面宣传，还可以重塑受偏见者良好的社会形象，打破会对其形成的刻板印象，并进而消除社会对他们的偏见。",
        },
        {
          max: "心理管制策略",
          center: "个体化策略",
          min:
            "加强网络信用体系及实名制建设，以高度鲜明的个体化网络角色震慑个体网络行为。",
          minni:
            "例如：各官方或非正式媒体平台都可以通过建立平台自身的信用体系，实名制等方式鲜明网络个体的形象，以扣除信用、警告等方式对带有负面偏差的信息发布进行震慑，以阻断个体行为。",
        },
        {
          max: "心理管制策略",
          center: "强化策略 ",
          min: "建立对信息发布的奖惩机制，其中以正强化方式为主。",
          minni:
            "例如：凡积累X天未发布不良消息，发布的接收者可以扩大至Y人，或是以信息发布等级评定的方式，根据影响对信息发布做正负性归类，再根据其影响程度给予相应奖励。",
        },
        {
          max: "心理管制策略",
          center: "认知修正策略",
          min:
            "对于跟歧视、偏见相关的偏差信息倡导者，可以采用群际接触的方式修正其认知。",
          minni:
            "例如：导入共同内群和交叉类别化弱化群体意识，进而降低内群偏好和外群歧视，缓解群际心理冲突。具体地，首先，引入“中国人”这一高于各社会群体的共同内群，增进共同群体归属感；其次，引入性别、年龄、地域等多重分类维度，使群体成员重新分类，令同一个体同时属于不同群体，弱化其群体意识，建立对多个群体的多重认同，不仅使个体部分地参与不同群体活动，同时也使得个体不可能在情感上绝对卷入群际冲突，从而降低群际冲突强度。",
        },
      ],
    };
  },
  // components: {
  // 	// showcontentvue
  // },
  mounted() {},
  methods: {
    objectSpanMethod({ row, column, rowIndex, columnIndex }) {
      if (columnIndex === 0) {
        console.log(rowIndex, columnIndex);
        if (rowIndex % 5 == 0) {
          return {
            rowspan: 5,
            colspan: 1,
          };
        } else {
          return {
            rowspan: 0,
            colspan: 0,
          };
        }
      }
    },
  },
};
</script>

<style>
</style>
